import { Gvar } from '../variable'
import * as Adap from '../adapter/index'


// ヴェネチアホテル専用マップ配置
async function func288(this: any) {
        Adap.dbgprt(288);
        Gvar.var_1096 = 1;
        Gvar.var_1098 = 1;
        Gvar.var_1100 = 1;
        Gvar.var_1102 = 1;
        Gvar.var_1082 = 30;
        Gvar.var_1084 = 34; // Y軸のマス数 23 → 42                   // この辺がヴェネチアホテルのマップ
        Gvar.var_983 =           "###################^^^########"; // 一番左上がX軸=5、Y軸=5
        Gvar.var_983 = Gvar.var_983 + "##########.########^^^111111##";
        Gvar.var_983 = Gvar.var_983 + "##########...######^^^111111##";
        Gvar.var_983 = Gvar.var_983 + "######........#####^^^111111##"; // この辺がヴェネチアホテルのマップ + ローマ・ティベレ河のマップ
        Gvar.var_983 = Gvar.var_983 + "#######.......#####^^^111111##";
        Gvar.var_983 = Gvar.var_983 + "#######.......#####^^^111111##";
        Gvar.var_983 = Gvar.var_983 + "###################^^^111111##";
        Gvar.var_983 = Gvar.var_983 + "###################^^^111111##";
        Gvar.var_983 = Gvar.var_983 + "###################^^^111111##";
        Gvar.var_983 = Gvar.var_983 + "###################^^^111111##";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##########....################"; // ジッパーの位置 X軸=15、Y軸=21
        Gvar.var_983 = Gvar.var_983 + "#########^#...################";
        Gvar.var_983 = Gvar.var_983 + "#######.#.....################"; // この辺が亀のマップ
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################"; // 一番左上がX軸=5、Y軸=5
        Gvar.var_983 = Gvar.var_983 + "#############.......##########"; // ロッコ・バロッコ所長の位置 X軸=8、Y軸=6
        Gvar.var_983 = Gvar.var_983 + "#############....#############"; 
        Gvar.var_983 = Gvar.var_983 + "#############........#########"; // ホテルへ戻る位置 X軸=15、Y軸=8
        Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########";
        Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // この辺がバーのマップ
        Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // 縦方向8 横方向7 テーブルの長さ3
        Gvar.var_983 = Gvar.var_983 + "#############.......##########";
        Gvar.var_983 = Gvar.var_983 + "#############.......##########";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        return;
}

export {func288}


// ヴェネチアホテル+亀マップ配置処理(亀の成長1)
async function func289(this: any) {
        Adap.dbgprt(289);
        Gvar.var_1096 = 1;
        Gvar.var_1098 = 1;
        Gvar.var_1100 = 1;
        Gvar.var_1102 = 1;
        Gvar.var_1082 = 30;
        Gvar.var_1084 = 34; // Y軸のマス数 23 → 42                   // この辺がヴェネチアホテルのマップ
        Gvar.var_983 =           "##############################"; // 一番左上がX軸=5、Y軸=5
        Gvar.var_983 = Gvar.var_983 + "##########.###################";
        Gvar.var_983 = Gvar.var_983 + "##########...#################";
        Gvar.var_983 = Gvar.var_983 + "######........################"; // この辺がヴェネチアホテルのマップ
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##########....################"; // ジッパーの位置 X軸=15、Y軸=21
        Gvar.var_983 = Gvar.var_983 + "#########^#...################";
        Gvar.var_983 = Gvar.var_983 + "#######.#.....################"; // この辺が亀のマップ
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "#######.......################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        Gvar.var_983 = Gvar.var_983 + "##############################"; // 一番左上がX軸=5、Y軸=5
        Gvar.var_983 = Gvar.var_983 + "#############.......##########"; // ロッコ・バロッコ所長の位置 X軸=8、Y軸=6
        Gvar.var_983 = Gvar.var_983 + "#############....#############"; 
        Gvar.var_983 = Gvar.var_983 + "#############........#########"; // ホテルへ戻る位置 X軸=15、Y軸=8
        Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########";
        Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // この辺がバーのマップ
        Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // 縦方向8 横方向7 テーブルの長さ3
        Gvar.var_983 = Gvar.var_983 + "#############.......##########";
        Gvar.var_983 = Gvar.var_983 + "#############.......##########";
        Gvar.var_983 = Gvar.var_983 + "##############################";
        return;
}

export {func289}

// ヴェネチアホテル+亀マップ配置処理(亀の成長2)
async function func290(this: any) {
    Adap.dbgprt(290);
    Gvar.var_1096 = 1;
    Gvar.var_1098 = 1;
    Gvar.var_1100 = 1;
    Gvar.var_1102 = 1;
    Gvar.var_1082 = 30; // X軸のマス数
    Gvar.var_1084 = 34; // Y軸のマス数 23 → 42                   // この辺がヴェネチアホテルのマップ
    Gvar.var_983 =           "##############################"; // 一番左上がX軸=5、Y軸=5
    Gvar.var_983 = Gvar.var_983 + "##########.###################";
    Gvar.var_983 = Gvar.var_983 + "##########...#################";
    Gvar.var_983 = Gvar.var_983 + "######........################"; // この辺がヴェネチアホテルのマップ
    Gvar.var_983 = Gvar.var_983 + "#######.......################";
    Gvar.var_983 = Gvar.var_983 + "#######.......################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##########....################"; // ジッパーの位置 X軸=15、Y軸=21
    Gvar.var_983 = Gvar.var_983 + "#########^#...################";
    Gvar.var_983 = Gvar.var_983 + "#######.#.....################"; // この辺が亀のマップ
    Gvar.var_983 = Gvar.var_983 + "#######.......################";
    Gvar.var_983 = Gvar.var_983 + "#######.......################";
    Gvar.var_983 = Gvar.var_983 + "#######.......################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################"; // 一番左上がX軸=5、Y軸=5
    Gvar.var_983 = Gvar.var_983 + "#############.......##########"; // ロッコ・バロッコ所長の位置 X軸=8、Y軸=6
    Gvar.var_983 = Gvar.var_983 + "#############....#############"; 
    Gvar.var_983 = Gvar.var_983 + "#############........#########"; // ホテルへ戻る位置 X軸=15、Y軸=8
    Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########";
    Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // この辺がバーのマップ
    Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // 縦方向8 横方向7 テーブルの長さ3
    Gvar.var_983 = Gvar.var_983 + "#############.......##########";
    Gvar.var_983 = Gvar.var_983 + "#############.......##########";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    return;
}

export {func290}

// ヴェネチアホテル+亀マップ配置処理(亀の成長3)
async function func291(this: any) {
    Adap.dbgprt(291);
    Gvar.var_1096 = 1;
    Gvar.var_1098 = 1;
    Gvar.var_1100 = 1;
    Gvar.var_1102 = 1;
    Gvar.var_1082 = 30; // X軸のマス数
    Gvar.var_1084 = 34; // Y軸のマス数 23 → 42                   // この辺がヴェネチアホテルのマップ
    Gvar.var_983 =           "##############################"; // 一番左上がX軸=5、Y軸=5
    Gvar.var_983 = Gvar.var_983 + "##########.###################";
    Gvar.var_983 = Gvar.var_983 + "##########...#################";
    Gvar.var_983 = Gvar.var_983 + "######........################"; // この辺がヴェネチアホテルのマップ
    Gvar.var_983 = Gvar.var_983 + "#######.......################"; // ホテルの入り口 X軸=7、Y軸=8
    Gvar.var_983 = Gvar.var_983 + "#######.......################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "######.###....################"; // ジッパーの位置 X軸=15、Y軸=21
    Gvar.var_983 = Gvar.var_983 + "######.##^#...################";
    Gvar.var_983 = Gvar.var_983 + "######..#.....################"; // この辺が亀のマップ
    Gvar.var_983 = Gvar.var_983 + "######........################";
    Gvar.var_983 = Gvar.var_983 + "######........################";
    Gvar.var_983 = Gvar.var_983 + "######........################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################"; // 一番左上がX軸=5、Y軸=5
    Gvar.var_983 = Gvar.var_983 + "#############.......##########"; // ロッコ・バロッコ所長の位置 X軸=8、Y軸=6
    Gvar.var_983 = Gvar.var_983 + "#############....#############"; 
    Gvar.var_983 = Gvar.var_983 + "#############........#########"; // ホテルへ戻る位置 X軸=15、Y軸=8
    Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########";
    Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // この辺がバーのマップ
    Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // 縦方向8 横方向7 テーブルの長さ3
    Gvar.var_983 = Gvar.var_983 + "#############.......##########";
    Gvar.var_983 = Gvar.var_983 + "#############.......##########";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    return;
}

export {func291}

// ヴェネチアホテル+亀マップ配置処理(亀の成長4)
async function func292(this: any) {
    Adap.dbgprt(292);
    Gvar.var_1096 = 1;
    Gvar.var_1098 = 1;
    Gvar.var_1100 = 1;
    Gvar.var_1102 = 1;
    Gvar.var_1082 = 30; // X軸のマス数
    Gvar.var_1084 = 34; // Y軸のマス数 23 → 42                   // この辺がヴェネチアホテルのマップ
    Gvar.var_983 =           "##############################"; // 一番左上がX軸=5、Y軸=5
    Gvar.var_983 = Gvar.var_983 + "##########.###################"; // 試練への入り口 X軸=15、Y軸=5(ディアボロはY軸6までしか移動できない)
    Gvar.var_983 = Gvar.var_983 + "##########...#################"; // 岸辺露伴 X軸=16、Y軸=7
    Gvar.var_983 = Gvar.var_983 + "######........################"; // ホテルの入り口 X軸=7、Y軸=8
    Gvar.var_983 = Gvar.var_983 + "#######.......################"; // ロッコ・バロッコ所長 X軸=18、Y軸=10
    Gvar.var_983 = Gvar.var_983 + "#######.......################"; // レクイエムへの入り口 X軸=17、Y軸=9
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "#####..###....################"; // ジッパーの位置 X軸=15、Y軸=21
    Gvar.var_983 = Gvar.var_983 + "#####..##^#...################"; // ^は水地形。X軸=14、Y軸=22。水地形へ侵入するとワープする。それを利用してホテルの座標へ移動させている。
    Gvar.var_983 = Gvar.var_983 + "#####...#.....################"; // この辺が亀のマップ
    Gvar.var_983 = Gvar.var_983 + "#####.........################";
    Gvar.var_983 = Gvar.var_983 + "#####.........################";
    Gvar.var_983 = Gvar.var_983 + "#####.........################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    Gvar.var_983 = Gvar.var_983 + "##############################"; // 一番左上がX軸=5、Y軸=5
    Gvar.var_983 = Gvar.var_983 + "#############.......##########"; // ロッコ・バロッコ所長の位置 X軸=18、Y軸=6
    Gvar.var_983 = Gvar.var_983 + "#############....#############"; 
    Gvar.var_983 = Gvar.var_983 + "#############........#########"; // ホテルへ戻る位置 X軸=15、Y軸=8
    Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########";
    Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // この辺がバーのマップ
    Gvar.var_983 = Gvar.var_983 + "#############.#..#..##########"; // 縦方向8 横方向7 テーブルの長さ3
    Gvar.var_983 = Gvar.var_983 + "#############.......##########";
    Gvar.var_983 = Gvar.var_983 + "#############.......##########";
    Gvar.var_983 = Gvar.var_983 + "##############################";
    return;
}

export {func292}