// ダンジョンクリア時のスコア判定
function func168() {
    return __awaiter(this, void 0, void 0, function* () {
        dbgprt(168);
        gmode(2);
        pos(0, 0);
        if (var_767 == 0) {
            gcopy(17, 360, 0, 340, 340);
        }
        if (var_767 == 1) {
            if (var_791 == 0) {
                gcopy(17, 360, 0, 340, 340);
            }
            if (var_791 == 1) {
                gcopy(17, 360, 720, 340, 340);
            }
            if (var_791 == 2) {
                gcopy(17, 720, 0, 340, 340);
            }
        }
        gmode(4, null, null, 100);
        pos(0, 0);
        gcopy(12, 0, 0, 340, 340);
        color(255, 255, 255);
        if (var_794 != 0) {
            color(150, 150, 150);
        }
        line(10, 10, 90, 10);
        line(255, 10, 325, 10);
        line(10, 200, 120, 200);
        line(225, 200, 325, 200);
        line(9, 11, 9, 198);
        line(327, 11, 327, 198);
        pset(10, 11);
        pset(326, 11);
        pset(10, 199);
        pset(326, 199);
        color(255, 255, 255);
        font("ＭＳ Ｐゴシック", 18, 1);
        if (var_793 == 1) {
            pos(130, 5);
            mes("ホテルの外");
        }
        if (var_793 == 2) {
            pos(95, 5);
            mes("レクイエムの大迷宮");
        }
        if (var_793 == 3) {
            pos(100, 5);
            mes("ディアボロの試練");
        }
        if (var_793 == 4) {
            pos(120, 5);
            mes("一巡後の世界");
        }
        if (var_793 == 0) {
            pos(136, 5);
            mes("" + var_21);
        }
        font("ＭＳ Ｐゴシック", 12, 1);
        pos(130, 195);
        color(255, 255, 255);
        if (var_794 != 0) {
            color(150, 150, 150);
        }
        if (var_767 == 0) {
            mes("<<  " + var_785 + "ページ  >>");
        }
        if (var_767 == 1) {
            color(255, 255, 255);
            line(110, 200, 230, 200);
        }
        var_796 = 1;
        if (var_785 == 2) {
            var_796 = 6;
        }
        if (var_785 == 3) {
            var_796 = 11;
        }
        if (var_785 == 4) {
            var_796 = 16;
        }
        var_797 = 1;
        font("ＭＳ Ｐゴシック", 14, 1);
        for (var cnt1 = 0; cnt1 < 5; ++cnt1) {
            if (var_796 < 20) {
                color(255, 255, 255);
                if (var_794 != 0) {
                    color(150, 150, 150);
                }
                if (var_796 == var_788) {
                    color(255, 0, 0);
                }
                pos(30, var_797 * 31);
                mes("" + var_796 + "位");
                if (var_792[var_793][var_796][3] != 0) {
                    pos(70, var_797 * 31);
                    mes("" + var_792[var_793][var_796][1] + " 階");
                    pos(120, var_797 * 31);
                    mes("スコア　" + var_792[var_793][var_796][3]);
                    color(0, 255, 0);
                    if (var_794 != 0) {
                        color(0, 190, 0);
                    }
                    if (var_796 == var_788) {
                        color(255, 0, 0);
                    }
                    pos(30, var_797 * 31 + 16);
                    var_356 = var_792[var_793][var_796][2];
                    yield func177();
                    mes("" + var_798);
                }
                if (var_792[var_793][var_796][3] == 0) {
                    pos(70, var_797 * 31);
                    mes("");
                }
            }
            if (var_796 == 20 && var_789 == 0) {
                color(255, 255, 255);
                if (var_794 != 0) {
                    color(150, 150, 150);
                }
                if (var_796 == var_788) {
                    color(255, 0, 0);
                }
                pos(30, var_797 * 31);
                mes("" + var_796 + "位");
                if (var_792[var_793][var_796][3] != 0) {
                    pos(70, var_797 * 31);
                    mes("" + var_792[var_793][var_796][1] + " 階");
                    pos(120, var_797 * 31);
                    mes("スコア　" + var_792[var_793][var_796][3]);
                    color(0, 255, 0);
                    if (var_794 != 0) {
                        color(0, 190, 0);
                    }
                    if (var_796 == var_788) {
                        color(255, 0, 0);
                    }
                    pos(30, var_797 * 31 + 16);
                    var_356 = var_792[var_793][var_796][2];
                    yield func177();
                    mes("" + var_798);
                }
                if (var_792[var_793][var_796][3] == 0) {
                    pos(70, var_797 * 31);
                    mes("");
                }
            }
            if (var_796 == 20 && var_789 == 1) {
                color(255, 0, 0);
                pos(30, var_797 * 31);
                mes("圏外");
                pos(70, var_797 * 31);
                mes("" + var_792[var_793][0][1] + " 階");
                pos(120, var_797 * 31);
                mes("スコア　" + var_792[var_793][0][3]);
                color(255, 0, 0);
                pos(30, var_797 * 31 + 16);
                var_356 = var_792[var_793][0][2];
                yield func177();
                mes("" + var_798);
            }
            var_796 = var_796 + 1;
            var_797 = var_797 + 1;
        }
        if (var_767 == 0) {
            font("ＭＳ Ｐゴシック", 14, 1);
            color(255, 255, 255);
            if (var_794 != 0) {
                color(150, 150, 150);
            }
            pos(13, var_787 * 31);
            mes(">");
            pos(14, var_787 * 31);
            mes(">");
            pos(15, var_787 * 31);
            mes(">");
        }
        color(255, 255, 255);
        line(10, 220, 325, 220);
        line(10, 332, 325, 332);
        line(9, 221, 9, 330);
        line(327, 221, 327, 330);
        pset(10, 221);
        pset(326, 221);
        pset(10, 331);
        pset(326, 331);
        font("ＭＳ Ｐゴシック", 14, 1);
        color(255, 255, 255);
        if (var_792[var_793][var_786][3] != 0) {
            var_487 = 0;
            pos(30, 225);
            var_232 = var_792[var_793][var_786][4];
            var_487 = 0;
            if (var_232 > 1000) {
                if (var_232 >= 1000 && var_232 < 2000) {
                    var_232 = var_232 - 1000;
                    var_487 = 1;
                }
                if (var_232 >= 2000 && var_232 < 3000) {
                    var_232 = var_232 - 2000;
                    var_487 = 2;
                }
                if (var_232 >= 3000 && var_232 < 4000) {
                    var_232 = var_232 - 3000;
                    var_487 = 3;
                }
            }
            yield func492();
            color(255, 255, 0);
            if (var_232 != 0) {
                var_799 = "攻撃：" + var_489;
                if (var_792[var_793][var_786][5] != 0) {
                    var_799 = var_799 + "＋" + var_792[var_793][var_786][5];
                }
                if (var_792[var_793][var_786][6] >= 2) {
                    var_799 = var_799 + "★" + var_792[var_793][var_786][6];
                }
                mes(var_799);
            }
            if (var_232 == 0) {
                mes("攻撃：なし");
            }
            pos(30, 242);
            var_232 = var_792[var_793][var_786][7];
            var_487 = 0;
            if (var_232 > 1000) {
                if (var_232 >= 1000 && var_232 < 2000) {
                    var_232 = var_232 - 1000;
                    var_487 = 1;
                }
                if (var_232 >= 2000 && var_232 < 3000) {
                    var_232 = var_232 - 2000;
                    var_487 = 2;
                }
                if (var_232 >= 3000 && var_232 < 4000) {
                    var_232 = var_232 - 3000;
                    var_487 = 3;
                }
            }
            yield func492();
            color(255, 180, 90);
            if (var_232 != 0) {
                var_799 = "防御：" + var_489;
                if (var_792[var_793][var_786][8] != 0) {
                    var_799 = var_799 + "＋" + var_792[var_793][var_786][8];
                }
                if (var_792[var_793][var_786][9] >= 2) {
                    var_799 = var_799 + "★" + var_792[var_793][var_786][9];
                }
                mes(var_799);
            }
            if (var_232 == 0) {
                mes("防御：なし");
            }
            pos(30, 259);
            var_232 = var_792[var_793][var_786][10];
            var_487 = 0;
            if (var_232 > 1000) {
                if (var_232 >= 1000 && var_232 < 2000) {
                    var_232 = var_232 - 1000;
                    var_487 = 1;
                }
                if (var_232 >= 2000 && var_232 < 3000) {
                    var_232 = var_232 - 2000;
                    var_487 = 2;
                }
                if (var_232 >= 3000 && var_232 < 4000) {
                    var_232 = var_232 - 3000;
                    var_487 = 3;
                }
            }
            yield func492();
            color(240, 0, 240);
            if (var_232 != 0) {
                var_799 = "能力：" + var_489;
                if (var_792[var_793][var_786][11] != 0) {
                    var_799 = var_799 + "＋" + var_792[var_793][var_786][11];
                }
                if (var_792[var_793][var_786][12] >= 2) {
                    var_799 = var_799 + "★" + var_792[var_793][var_786][12];
                }
                mes(var_799);
            }
            if (var_232 == 0) {
                mes("能力：なし");
            }
            font("ＭＳ Ｐゴシック", 14, 1);
            color(255, 255, 255);
            pos(40, 276);
            mes("レベル：" + var_792[var_793][var_786][14]);
            pos(180, 276);
            mes("精神力：" + var_792[var_793][var_786][17] + "/" + var_792[var_793][var_786][16]);
            pos(40, 293);
            mes("最大HP：" + var_792[var_793][var_786][15]);
            pos(180, 293);
            mes("満腹度：" + var_792[var_793][var_786][18]);
            pos(40, 310);
            mes("ターン：" + var_792[var_793][var_786][0]);
            if (var_792[var_793][var_786][50] != 0) {
                pos(180, 310);
                mes("" + var_792[var_793][var_786][50] + "年" + var_792[var_793][var_786][51] + "月" + var_792[var_793][var_786][52] + "日");
            }
            if (var_794 >= 1) {
                color(255, 255, 255);
                font("MS ゴシック", 16, 1);
                pos(13, var_795);
                mes(">");
                pos(14, var_795);
                mes(">");
                pos(15, var_795);
                mes(">");
            }
        }
        return;
    });
}