// 敵リスト
function func626() {
    return __awaiter(this, void 0, void 0, function* () {
        dbgprt(626);
        var_891 = "";
        var_967 = 0;
        var_968 = 0;
        var_954 = 0;
        var_438 = 0;
        var_1637 = 0;
        var_1654 = 100;
        var_972 = 0;
        var_1655 = "";
        var_1656 = "";
        var_1657 = "";
        var_1658 = "";
        var_1619 = 0;
        if (var_437 == 79) {
            var_891 = "ｴｺｰｽﾞの卵";
            var_967 = 0;
            var_968 = 0;
            var_954 = 2;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 8;
            var_1619 = 414;
            var_1655 = "・動かないぞ。";
            var_1656 = "・攻撃してこないぞ。";
            var_1657 = "・倒すと成長することがあるぞ。";
            var_1658 = "・模様の違う卵には要注意だ。";
        }
        if (var_437 == 1) {
            var_891 = "ﾔｸ中のｺﾞﾛﾂｷ";
            var_967 = 3;
            var_968 = 1;
            var_954 = 3;
            var_438 = 4;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 528;
            var_1655 = "・フラフラと歩くぞ。";
            var_1656 = "・必ず「ｵﾚｯちのｺｰﾄ」を落とすぞ。";
            var_1657 = "・ｺｰﾄを持っていると向かってくるぞ。";
            var_1658 = "・ｺｰﾄが落ちているとそこへ向かうぞ。";
        }
        if (var_437 == 5) {
            var_891 = "小汚い浮浪者";
            var_967 = 2;
            var_968 = 2;
            var_954 = 3;
            var_438 = 5;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 105;
            var_1655 = "・とくに何もないぞ。";
            var_1656 = "・衛生観念のない虫けら同然の浮浪者だ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 88) {
            var_891 = "ﾄﾞﾉｳﾞｧﾝ";
            var_967 = 3;
            var_968 = 2;
            var_954 = 4;
            var_438 = 6;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 206;
            var_1655 = "・ヒラヒラと舞って攻撃が当たりにくいぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 147) {
            var_891 = "ｼﾞｮｾﾌ";
            var_967 = 1;
            var_968 = 2;
            var_954 = 3;
            var_438 = 6;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 438;
            var_1655 = "・フラフラと歩くぞ。";
            var_1656 = "・攻撃してこないぞ。";
            var_1657 = "・多分ボケちゃっているぞ。";
            var_1658 = "";
        }
        if (var_437 == 2) {
            var_891 = "ヌケサク";
            var_967 = 4;
            var_968 = 3;
            var_954 = 5;
            var_438 = 7;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 363;
            var_1655 = "・とくに何もないぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 93) {
            var_891 = "ｴﾝﾎﾟﾘｵ";
            var_967 = 5;
            var_968 = 4;
            var_954 = 7;
            var_438 = 7;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 604;
            var_1655 = "・幽霊の弾丸を撃ってくるぞ。";
            var_1656 = "・特別なスタンドを扱えそうだ…";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 3) {
            var_891 = "ﾀﾜｰ･ｵﾌﾞ･ｸﾞﾚｰ";
            var_967 = 6;
            var_968 = 5;
            var_954 = 8;
            var_438 = 9;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 311;
            var_1655 = "・近い場所に瞬間移動することがあるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 94) {
            var_891 = "ブルりん";
            var_967 = 8;
            var_968 = 6;
            var_954 = 15;
            var_438 = 13;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 203;
            var_1655 = "・掴まえて動けなくしてくるぞ。";
            var_1656 = "・「たのもしいわ！あたしのブルりん！」";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 77) {
            var_891 = "ｴｺｰｽﾞACT1";
            var_967 = 7;
            var_968 = 5;
            var_954 = 13;
            var_438 = 12;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 8;
            var_1619 = 415;
            var_1655 = "・音を貼り付けて混乱させてくるぞ。";
            var_1656 = "・倒すと成長することがあるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 51) {
            var_891 = "ﾜﾝﾁｪﾝ";
            var_967 = 8;
            var_968 = 6;
            var_954 = 20;
            var_438 = 14;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 107;
            var_1655 = "・とくに何もないぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 7) {
            var_891 = "運命の車輪";
            var_967 = 8;
            var_968 = 7;
            var_954 = 36;
            var_438 = 18;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 316;
            var_1655 = "・ガソリンの弾丸を撃ってくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 9) {
            var_891 = "ﾗﾊﾞｰｿｳﾙ";
            var_967 = 8;
            var_968 = 8;
            var_954 = 40;
            var_438 = 17;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 314;
            var_1655 = "・殴ると肉片が貼り付いてしまうことがあるぞ。";
            var_1656 = "・アイテムを投げると食べて攻撃力が上がるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 39) {
            var_891 = "ﾊｲｳｪｲｽﾀｰ";
            var_967 = 7;
            var_968 = 5;
            var_954 = 48;
            var_438 = 14;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 8;
            var_1619 = 445;
            var_1655 = "・倍の速さで移動するぞ。";
            var_1656 = "・養分を吸い取って満腹度を下げてくるぞ。";
            var_1657 = "・特別なアイテムを持っていることがあるぞ。";
            var_1658 = "";
        }
        if (var_437 == 26) {
            var_891 = "ﾊｰｳﾞｪｽﾄ";
            var_967 = 12;
            var_968 = 8;
            var_954 = 30;
            var_438 = 12;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 8;
            var_1619 = 441;
            var_1655 = "・アイテムを盗んで逃げるぞ。";
            var_1656 = "・落ちているアイテムも拾って逃げるぞ。";
            var_1657 = "・盗んだ後は倍の速さで移動するぞ。";
            var_1658 = "";
        }
        if (var_437 == 76) {
            var_891 = "ｴｺｰｽﾞACT2";
            var_967 = 9;
            var_968 = 6;
            var_954 = 46;
            var_438 = 19;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 8;
            var_1619 = 417;
            var_1655 = "・文字を投げつけて攻撃してくるぞ。";
            var_1656 = "・地面に文字の罠を貼り付けるぞ。";
            var_1657 = "・倒すと成長することがあるぞ。";
            var_1658 = "";
        }
        if (var_437 == 6) {
            var_891 = "ｴﾎﾞﾆｰﾃﾞﾋﾞﾙの人形";
            var_967 = 9;
            var_968 = 7;
            var_954 = 45;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 0;
            var_1619 = 312;
            var_1655 = "・攻撃を受けると恨みで攻撃力が上がるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 165) {
            var_891 = "ｴﾎﾞﾆｰﾃﾞﾋﾞﾙ";
            var_967 = 9;
            var_968 = 40;
            var_954 = 5;
            var_438 = 5;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 3;
            var_1619 = 313;
            var_1655 = "・他の敵に乗り移ってレベルを上げるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 52) {
            var_891 = "ｼﾞｬｯｸ･ｻﾞ･ﾘﾊﾟｰ";
            var_967 = 12;
            var_968 = 5;
            var_954 = 60;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 108;
            var_1655 = "・とくに何もないぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 73) {
            var_891 = "ﾀﾞｲｱｰさん";
            var_967 = 10;
            var_968 = 6;
            var_954 = 52;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 111;
            var_1655 = "・倒すと首だけになって残るぞ。";
            var_1656 = "・首に触れると波紋のバラを飛ばしてくるぞ。";
            var_1657 = "・凍った状態になると弱いぞ。";
            var_1658 = "";
        }
        if (var_437 == 101) {
            var_891 = "ﾍﾟｲｼﾞ";
            var_967 = 10;
            var_968 = 5;
            var_954 = 50;
            var_438 = 16;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 113;
            var_1655 = "・常に４人組で行動するぞ。";
            var_1656 = "・必ず眠っているぞ。";
            var_1657 = "・一人に攻撃すると、皆で襲ってくるぞ。";
            var_1658 = "・倍の速さで移動するぞ。";
        }
        if (var_437 == 102) {
            var_891 = "ｼﾞｮｰﾝｽﾞ";
            var_967 = 10;
            var_968 = 5;
            var_954 = 50;
            var_438 = 16;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 114;
            var_1655 = "・常に４人組で行動するぞ。";
            var_1656 = "・必ず眠っているぞ。";
            var_1657 = "・一人に攻撃すると、皆で襲ってくるぞ。";
            var_1658 = "・倍の速さで移動するぞ。";
        }
        if (var_437 == 103) {
            var_891 = "ﾌﾟﾗﾝﾄ";
            var_967 = 10;
            var_968 = 5;
            var_954 = 50;
            var_438 = 16;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 115;
            var_1655 = "・常に４人組で行動するぞ。";
            var_1656 = "・必ず眠っているぞ。";
            var_1657 = "・一人に攻撃すると、皆で襲ってくるぞ。";
            var_1658 = "・倍の速さで移動するぞ。";
        }
        if (var_437 == 104) {
            var_891 = "ﾎﾞｰﾝﾅﾑ";
            var_967 = 10;
            var_968 = 5;
            var_954 = 50;
            var_438 = 16;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 116;
            var_1655 = "・常に４人組で行動するぞ。";
            var_1656 = "・必ず眠っているぞ。";
            var_1657 = "・一人に攻撃すると、皆で襲ってくるぞ。";
            var_1658 = "・倍の速さで移動するぞ。";
        }
        if (var_437 == 141) {
            var_891 = "F・F";
            var_967 = 11;
            var_968 = 6;
            var_954 = 72;
            var_438 = 18;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 603;
            var_1655 = "・ＦＦの弾丸を撃ってくるぞ。";
            var_1656 = "・弾丸が他の敵に当たると体力が回復するぞ。";
            var_1657 = "・熱湯に弱いぞ。";
            var_1658 = "";
        }
        if (var_437 == 134) {
            var_891 = "ｼﾞｮﾘｰﾝ";
            var_967 = 13;
            var_968 = 7;
            var_954 = 88;
            var_438 = 25;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 601;
            var_1655 = "・近くに怪我をした敵がいると治しに行くぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 4) {
            var_891 = "ﾃﾞｽ･13";
            var_967 = 11;
            var_968 = 6;
            var_954 = 95;
            var_438 = 21;
            var_1637 = 0;
            var_1654 = 8;
            var_972 = 3;
            var_1619 = 325;
            var_1655 = "・時々眠らせてくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 13) {
            var_891 = "ﾗﾊﾞｰｽﾞ";
            var_967 = 10;
            var_968 = 8;
            var_954 = 75;
            var_438 = 18;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 322;
            var_1655 = "・攻撃すると分裂して増えることがあるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 119) {
            var_891 = "ｼﾞｮｾﾌ";
            var_967 = 9;
            var_968 = 3;
            var_954 = 90;
            var_438 = 28;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 302;
            var_1655 = "・スタンドで縛り付けて動けなくさせるぞ。";
            var_1656 = "・攻撃されると波紋で痺れることがあるぞ。";
            var_1657 = "・老化攻撃を受けると弱くなってしまうぞ。";
            var_1658 = "";
        }
        if (var_437 == 99) {
            var_891 = "ﾏﾝﾊｯﾀﾝﾄﾗﾝｽﾌｧｰ";
            var_967 = 12;
            var_968 = 6;
            var_954 = 85;
            var_438 = 18;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 607;
            var_1655 = "・フワフワと動いているぞ。";
            var_1656 = "・気流に舞って攻撃が当たりにくいぞ。";
            var_1657 = "・近くにいると弾丸を撃ってくるぞ。";
            var_1658 = "・この弾丸は防御力の影響を受けないぞ。";
        }
        if (var_437 == 138) {
            var_891 = "ﾃﾞｨｵ･ﾌﾞﾗﾝﾄﾞｰ";
            var_967 = 13;
            var_968 = 8;
            var_954 = 100;
            var_438 = 25;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 102;
            var_1655 = "・殴ると凍ってしまうことがあるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 71) {
            var_891 = "ﾄﾞｩｰﾋﾞｰ";
            var_967 = 14;
            var_968 = 9;
            var_954 = 130;
            var_438 = 34;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 112;
            var_1655 = "・とくに何もないぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 12) {
            var_891 = "ｴｺｰｽﾞACT3";
            var_967 = 11;
            var_968 = 7;
            var_954 = 100;
            var_438 = 25;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 8;
            var_1619 = 419;
            var_1655 = "・体を重くして鈍足にしてくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 20) {
            var_891 = "ｴﾝﾔ婆";
            var_967 = 11;
            var_968 = 5;
            var_954 = 200;
            var_438 = 80;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 1;
            var_1619 = 317;
            var_1655 = "・倍の速さで動いているぞ。";
            var_1656 = "・動く死体を呼び出すことがあるぞ。";
            var_1657 = "・ダンジョンの主だぞ。";
            var_1658 = "";
        }
        if (var_437 == 24) {
            var_891 = "穴ﾎﾞｺﾁｰｽﾞの死体";
            var_967 = 8;
            var_968 = 4;
            var_954 = 40;
            var_438 = 13;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 0;
            var_1619 = 319;
            var_1655 = "・エンヤ婆に操られている死体だ。";
            var_1656 = "・エンヤ婆がやられると、ただの死体に戻るぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 25) {
            var_891 = "子連れﾆｷﾋﾞの死体";
            var_967 = 8;
            var_968 = 4;
            var_954 = 40;
            var_438 = 13;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 0;
            var_1619 = 320;
            var_1655 = "・エンヤ婆に操られている死体だ。";
            var_1656 = "・エンヤ婆がやられると、ただの死体に戻るぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 8) {
            var_891 = "無愛想親父の死体";
            var_967 = 8;
            var_968 = 4;
            var_954 = 40;
            var_438 = 13;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 0;
            var_1619 = 318;
            var_1655 = "・エンヤ婆に操られている死体だ。";
            var_1656 = "・エンヤ婆がやられると、ただの死体に戻るぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 56) {
            var_891 = "ｼｭﾄﾛﾊｲﾑ";
            var_967 = 13;
            var_968 = 10;
            var_954 = 110;
            var_438 = 23;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 204;
            var_1655 = "・マシンガンを撃ってくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 28) {
            var_891 = "ｼﾞｬｯｼﾞﾒﾝﾄ";
            var_967 = 15;
            var_968 = 12;
            var_954 = 150;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 326;
            var_1655 = "・土人形を作り出すことがあるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 22) {
            var_891 = "ｱｳﾞﾄﾞｩﾙ人形";
            var_967 = 11;
            var_968 = 1;
            var_954 = 50;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 0;
            var_1619 = 327;
            var_1655 = "・ジャッジメントに作られた土人形だ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 31) {
            var_891 = "吉良の親父";
            var_967 = 13;
            var_968 = 9;
            var_954 = 95;
            var_438 = 22;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 444;
            var_1655 = "・フワフワと動いているぞ。";
            var_1656 = "・親父がいる部屋は写真の中だ。";
            var_1657 = "　倒さないと出られないぞ。";
            var_1658 = "・弓矢を落とすことがあるぞ。";
        }
        if (var_437 == 140) {
            var_891 = "ｼﾞｮﾅｻﾝ";
            var_967 = 15;
            var_968 = 11;
            var_954 = 120;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 101;
            var_1655 = "・攻撃時に波紋で痺れさせることがあるぞ。";
            var_1656 = "・ズームパンチで２マス先まで攻撃するぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 148) {
            var_891 = "ｴﾙﾒｪｽ";
            var_967 = 12;
            var_968 = 10;
            var_954 = 110;
            var_438 = 27;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 602;
            var_1655 = "・地面にキッスのシールを貼るぞ。";
            var_1656 = "・他の敵がシールに触れると分裂するぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 131) {
            var_891 = "ｼﾞｮﾙﾉ";
            var_967 = 14;
            var_968 = 14;
            var_954 = 135;
            var_438 = 25;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 9;
            var_1619 = 501;
            var_1655 = "・アイテムをカエルに変化させるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 115) {
            var_891 = "ｱｸｱ･ﾈｯｸﾚｽ";
            var_967 = 14;
            var_968 = 13;
            var_954 = 120;
            var_438 = 26;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 8;
            var_1619 = 404;
            var_1655 = "・霧になって他の場所へ瞬間移動するぞ。";
            var_1656 = "・念写に写りこんでしまう事があるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 11) {
            var_891 = "ﾜｲｱｰﾄﾞのﾍﾞｯｸ";
            var_967 = 16;
            var_968 = 15;
            var_954 = 150;
            var_438 = 38;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 212;
            var_1655 = "・とくに何もないぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 45) {
            var_891 = "由花子";
            var_967 = 12;
            var_968 = 13;
            var_954 = 142;
            var_438 = 32;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 433;
            var_1655 = "・ｽﾀﾝﾄﾞDISCに呪縛をかけてくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 29) {
            var_891 = "ｸﾞﾘｰﾝ･ﾃﾞｨ";
            var_967 = 15;
            var_968 = 5;
            var_954 = 165;
            var_438 = 80;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 525;
            var_1655 = "・同じ部屋にいると階段を降りられないぞ";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 47) {
            var_891 = "億泰";
            var_967 = 17;
            var_968 = 14;
            var_954 = 170;
            var_438 = 36;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 405;
            var_1655 = "・ガオンと近くに引き寄せてくるぞ。";
            var_1656 = "・強烈な一撃を繰り出すことがあるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 27) {
            var_891 = "ｹﾞﾌﾞ神";
            var_967 = 16;
            var_968 = 13;
            var_954 = 195;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 342;
            var_1655 = "・地面に潜って他の場所に移動するぞ。";
            var_1656 = "・足を掴んで移動できなくさせるぞ。";
            var_1657 = "・目を切り裂いて盲目にしてくるぞ。";
            var_1658 = "";
        }
        if (var_437 == 136) {
            var_891 = "ｼｰｻﾞｰ";
            var_967 = 15;
            var_968 = 12;
            var_954 = 180;
            var_438 = 42;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 207;
            var_1655 = "・波紋を帯びたシャボンを発射してくるぞ。";
            var_1656 = "・あたると痺れることがあるぞ。";
            var_1657 = "・攻撃されても波紋で痺れることがあるぞ。";
            var_1658 = "";
        }
        if (var_437 == 38) {
            var_891 = "ｱﾚｯｼｰ";
            var_967 = 18;
            var_968 = 12;
            var_954 = 220;
            var_438 = 45;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 348;
            var_1655 = "・若返り攻撃でレベルを下げてくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 48) {
            var_891 = "ｴｱﾛｽﾐｽ";
            var_967 = 15;
            var_968 = 12;
            var_954 = 200;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 10;
            var_1619 = 507;
            var_1655 = "・弾丸を発射してくるぞ。";
            var_1656 = "・どこからでも位置を察して飛んでくるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 78) {
            var_891 = "ｱｳﾞﾄﾞｩﾙさん";
            var_967 = 19;
            var_968 = 13;
            var_954 = 230;
            var_438 = 50;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 303;
            var_1655 = "・レッドバインドで縛り付けてくるぞ。";
            var_1656 = "・喰らうとスタンドが弱くなってしまうぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 62) {
            var_891 = "ﾍﾞｲﾋﾞｨﾌｪｲｽ";
            var_967 = 18;
            var_968 = 16;
            var_954 = 245;
            var_438 = 50;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 3;
            var_1619 = 516;
            var_1655 = "・アイテムに化けているぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 17) {
            var_891 = "ｼｱｰﾊｰﾄｱﾀｯｸ";
            var_967 = 14;
            var_968 = 40;
            var_954 = 300;
            var_438 = 5;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 8;
            var_1619 = 443;
            var_1655 = "・体力が少なくなると爆発するぞ。";
            var_1656 = "・自分が爆発に巻き込まれると誘爆するぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 46) {
            var_891 = "ﾎﾙ･ﾎｰｽ";
            var_967 = 15;
            var_968 = 16;
            var_954 = 262;
            var_438 = 42;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 315;
            var_1655 = "・付かず離れず距離をとってくるぞ。";
            var_1656 = "・時々エンペラーの弾丸を発射するぞ。";
            var_1657 = "・この弾丸は防御力の影響を受けないぞ。";
            var_1658 = "・ガラスの破片をバラ撒くこともあるぞ。";
        }
        if (var_437 == 97) {
            var_891 = "ｵｲﾝｺﾞ";
            var_967 = 10;
            var_968 = 1;
            var_954 = 100;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 343;
            var_1655 = "・誰か他の敵に化けていることがあるぞ。";
            var_1656 = "・爆弾仕掛けのオレンジを落とすぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 125) {
            var_891 = "ﾌｰｺﾞ";
            var_967 = 19;
            var_968 = 15;
            var_954 = 320;
            var_438 = 42;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 9;
            var_1619 = 506;
            var_1655 = "・ｳｨﾙｽで部屋の全員にﾀﾞﾒｰｼﾞを与えるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 14) {
            var_891 = "床屋のｶｰﾝ";
            var_967 = 18;
            var_968 = 17;
            var_954 = 350;
            var_438 = 48;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 345;
            var_1655 = "・ダメージを受けると攻撃力がアップするぞ。";
            var_1656 = "・強烈な一撃を繰り出すことがあるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 69) {
            var_891 = "ﾌﾞﾗﾌｫｰﾄﾞ";
            var_967 = 18;
            var_968 = 16;
            var_954 = 290;
            var_438 = 50;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 109;
            var_1655 = "・髪の毛で縛り付けてくるぞ。";
            var_1656 = "・縛られた髪の毛で満腹度を吸い取るぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 59) {
            var_891 = "ﾌﾟｯﾁ神父";
            var_967 = 15;
            var_968 = 18;
            var_954 = 360;
            var_438 = 54;
            var_1637 = 1;
            var_1654 = 6;
            var_972 = 1;
            var_1619 = 618;
            var_1655 = "・装備しているDISCを抜き取ってしまうぞ。";
            var_1656 = "・やっつければ取り戻せるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 145) {
            var_891 = "康一";
            var_967 = 16;
            var_968 = 16;
            var_954 = 280;
            var_438 = 30;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 412;
            var_1655 = "・付かず離れず距離をとってくるぞ。";
            var_1656 = "・３種類のエコーズを呼び出すぞ。";
            var_1657 = "・隣接すると重くなる攻撃をしてくるぞ。";
            var_1658 = "";
        }
        if (var_437 == 18) {
            var_891 = "ﾌﾞﾗｯｸ･ｻﾊﾞｽ";
            var_967 = 14;
            var_968 = 15;
            var_954 = 300;
            var_438 = 42;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 3;
            var_1619 = 511;
            var_1655 = "・影から影へ、瞬間的に移動するぞ。";
            var_1656 = "・矢を刺して選別してくるぞ。";
            var_1657 = "・選ばれると装備品に新たな能力がつくぞ。";
            var_1658 = "・矢かライターを落とすぞ。";
        }
        if (var_437 == 35) {
            var_891 = "仗助";
            var_967 = 20;
            var_968 = 18;
            var_954 = 380;
            var_438 = 42;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 401;
            var_1655 = "・近くに怪我をした敵がいると治しに行くぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 135) {
            var_891 = "若ｼﾞｮｾﾌ";
            var_967 = 19;
            var_968 = 20;
            var_954 = 390;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 201;
            var_1655 = "・付かず離れず距離をとってくるぞ。";
            var_1656 = "・地面に罠を仕掛けるぞ。";
            var_1657 = "・攻撃されると波紋で痺れることがあるぞ。";
            var_1658 = "・老化攻撃を受けると弱くなってしまうぞ。";
        }
        if (var_437 == 10) {
            var_891 = "ﾉﾄｰﾘｱｽBIG";
            var_967 = 19;
            var_968 = 1;
            var_954 = 320;
            var_438 = 140;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 521;
            var_1655 = "・攻撃すると肉片を貼り付けることがあるぞ。";
            var_1656 = "・速く動いても同じ速度で追ってくるぞ。";
            var_1657 = "・ゆっくり動くと追いかけてこないぞ。";
            var_1658 = "・アイテムを投げると食べて攻撃力が上がるぞ。";
        }
        if (var_437 == 95) {
            var_891 = "ｽﾄﾚｲﾂｫ";
            var_967 = 19;
            var_968 = 18;
            var_954 = 445;
            var_438 = 46;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 202;
            var_1655 = "・目から体液を発射してくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 63) {
            var_891 = "ﾌﾟﾛｼｭｰﾄ兄貴";
            var_967 = 20;
            var_968 = 17;
            var_954 = 520;
            var_438 = 45;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 9;
            var_1619 = 513;
            var_1655 = "・接触老化で最大精神力や最大ＨＰが下がるぞ。";
            var_1656 = "・同じ部屋にいると精神力を下げてくるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 84) {
            var_891 = "ﾁｮｺﾗｰﾀ";
            var_967 = 10;
            var_968 = 19;
            var_954 = 360;
            var_438 = 62;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 523;
            var_1655 = "・付かず離れず距離をとってくるぞ。";
            var_1656 = "・グリーンディやセッコを呼び出すぞ。";
            var_1657 = "・近くのセッコの攻撃力を上げるぞ。";
            var_1658 = "・分離して逃げることがあるぞ。";
        }
        if (var_437 == 117) {
            var_891 = "ﾁｮｺﾗｰﾀの上半身";
            var_967 = 10;
            var_968 = 10;
            var_954 = 10;
            var_438 = 10;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 524;
            var_1655 = "・すばやい動きで逃げるぞ。";
            var_1656 = "・倒すと「やばいクスリ」を落とす事があるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 43) {
            var_891 = "ｾｯｺ";
            var_967 = 21;
            var_968 = 20;
            var_954 = 580;
            var_438 = 40;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 526;
            var_1655 = "・ウロウロしながら近づいてくるぞ。";
            var_1656 = "・壁の中でも自由に移動できるぞ。";
            var_1657 = "・壁の中にいる時は普通の攻撃が効かないぞ。";
            var_1658 = "・タイヤが当たると混乱するぞ。";
        }
        if (var_437 == 85) {
            var_891 = "ﾘｿﾞｯﾄ";
            var_967 = 10;
            var_968 = 18;
            var_954 = 600;
            var_438 = 43;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 9;
            var_1619 = 522;
            var_1655 = "・磁力によって普段は姿が見えないぞ。";
            var_1656 = "・ランダムに移動しているぞ。";
            var_1657 = "・体内で刃物を作る攻撃をしてくるぞ。";
            var_1658 = "";
        }
        if (var_437 == 32) {
            var_891 = "吉良吉影";
            var_967 = 22;
            var_968 = 20;
            var_954 = 750;
            var_438 = 65;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 7;
            var_1619 = 442;
            var_1655 = "・アイテムを爆弾に変えてくるぞ。";
            var_1656 = "・床のアイテムも爆弾に変えることがあるぞ。";
            var_1657 = "・ｼｱｰﾊｰﾄｱﾀｯｸを繰り出すことがあるぞ。";
            var_1658 = "";
        }
        if (var_437 == 44) {
            var_891 = "ﾚｯﾄﾞﾎｯﾄﾁﾘﾍﾟｯﾊﾟｰ";
            var_967 = 20;
            var_968 = 16;
            var_954 = 630;
            var_438 = 52;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 8;
            var_1619 = 437;
            var_1655 = "・地下の電線を使って近くに瞬間移動するぞ。";
            var_1656 = "・２回連続で攻撃してくるぞ。";
            var_1657 = "・水に入るとダメージを受けるぞ。";
            var_1658 = "・タイヤに弱いぞ。";
        }
        if (var_437 == 72) {
            var_891 = "ｹﾝｿﾞｰ";
            var_967 = 18;
            var_968 = 18;
            var_954 = 710;
            var_438 = 42;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 616;
            var_1655 = "・こちらの攻撃をヒラリとかわしやすいぞ。";
            var_1656 = "・風水の力で罠をたくさん呼び寄せるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 66) {
            var_891 = "ﾀﾙｶｽ";
            var_967 = 23;
            var_968 = 22;
            var_954 = 800;
            var_438 = 65;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 110;
            var_1655 = "・強烈な一撃を繰り出すことがあるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 113) {
            var_891 = "DIO";
            var_967 = 23;
            var_968 = 22;
            var_954 = 1400;
            var_438 = 75;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 2;
            var_1619 = 364;
            var_1655 = "・時間を止めて自分だけ動くぞ。";
            var_1656 = "・ジョセフを倒すとパワーアップするぞ。";
            var_1657 = "・まれに何か投げるぞ。";
            var_1658 = "・近くにいると階段を降りられないぞ。";
        }
        if (var_437 == 15) {
            var_891 = "ﾍﾟｯﾄｼｮｯﾌﾟ";
            var_967 = 21;
            var_968 = 19;
            var_954 = 850;
            var_438 = 40;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 0;
            var_1619 = 360;
            var_1655 = "・氷のミサイルを発射してくるぞ。";
            var_1656 = "・隣接時に氷漬けにしてくるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 123) {
            var_891 = "ﾌﾞﾁｬﾗﾃｨ";
            var_967 = 22;
            var_968 = 21;
            var_954 = 900;
            var_438 = 60;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 9;
            var_1619 = 503;
            var_1655 = "・２マス先まで攻撃が届くぞ。";
            var_1656 = "・あいだに他の敵がいても攻撃が届くぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 80) {
            var_891 = "ﾗﾝｸﾞ･ﾗﾝｸﾞﾗｰ";
            var_967 = 18;
            var_968 = 19;
            var_954 = 720;
            var_438 = 55;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 611;
            var_1655 = "・唾を吐いてくるぞ。";
            var_1656 = "・当たると無重力で思うように動けなくなるぞ。";
            var_1657 = "・隣接していても無重力攻撃をしてくるぞ。";
            var_1658 = "";
        }
        if (var_437 == 65) {
            var_891 = "虹村形兆";
            var_967 = 10;
            var_968 = 18;
            var_954 = 700;
            var_438 = 55;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 407;
            var_1655 = "・付かず離れず距離をとるぞ。";
            var_1656 = "・バッドカンパニー部隊を呼び出すぞ。";
            var_1657 = "・グリーンベレーを呼び出すぞ。";
            var_1658 = "・地面に地雷を仕掛けるぞ。";
        }
        if (var_437 == 40) {
            var_891 = "ﾊﾞｯﾄﾞｶﾝﾊﾟﾆｰ";
            var_967 = 10;
            var_968 = 5;
            var_954 = 5;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 8;
            var_1619 = 408;
            var_1655 = "・形兆が呼び出したスタンドだ。";
            var_1656 = "・弾丸を発射してくるぞ。";
            var_1657 = "・仲間の弾丸には当たらないぞ。";
            var_1658 = "";
        }
        if (var_437 == 41) {
            var_891 = "ﾊﾞｯﾄﾞｶﾝﾊﾟﾆｰ戦車";
            var_967 = 14;
            var_968 = 13;
            var_954 = 7;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 8;
            var_1619 = 410;
            var_1655 = "・形兆が呼び出したスタンドだ。";
            var_1656 = "・砲弾を発射してくるぞ。";
            var_1657 = "・仲間の弾丸には当たらないぞ。";
            var_1658 = "";
        }
        if (var_437 == 42) {
            var_891 = "ｱﾊﾟｯﾁ";
            var_967 = 16;
            var_968 = 10;
            var_954 = 8;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 8;
            var_1619 = 411;
            var_1655 = "・形兆が呼び出したスタンドだ。";
            var_1656 = "・ミサイルを発射してくるぞ。";
            var_1657 = "・仲間の弾丸には当たらないぞ。";
            var_1658 = "";
        }
        if (var_437 == 54) {
            var_891 = "ｸﾞﾘｰﾝﾍﾞﾚｰ";
            var_967 = 20;
            var_968 = 5;
            var_954 = 10;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 8;
            var_1619 = 409;
            var_1655 = "・形兆が呼び出したスタンドだ。";
            var_1656 = "・仲間の弾丸には当たらないぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 132) {
            var_891 = "ﾚｸｲｴﾑｼﾞｮﾙﾉ";
            var_967 = 25;
            var_968 = 23;
            var_954 = 1500;
            var_438 = 300;
            var_1637 = 1;
            var_1654 = 1;
            var_972 = 9;
            var_1619 = 527;
            var_1655 = "・攻撃を受けると状態異常がすべて元に戻るぞ。";
            var_1656 = "・状態異常の他にもいろいろ元に戻すぞ。";
            var_1657 = "・離れているとサソリを飛ばしてくるぞ。";
            var_1658 = "・ダンジョンの主だぞ。";
        }
        if (var_437 == 30) {
            var_891 = "禁煙中ﾎﾙ･ﾎｰｽ";
            var_967 = 15;
            var_968 = 16;
            var_954 = 650;
            var_438 = 45;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 349;
            var_1655 = "・付かず離れず距離をとるぞ。";
            var_1656 = "・時々エンペラーの弾丸を発射するぞ。";
            var_1657 = "・この弾丸は防御力の影響を受けないぞ。";
            var_1658 = "・予知によって弾丸のダメージが変わるぞ。";
        }
        if (var_437 == 21) {
            var_891 = "ｽﾄﾚｲ･ｷｬｯﾄ";
            var_967 = 15;
            var_968 = 15;
            var_954 = 100;
            var_438 = 45;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 6;
            var_1619 = 446;
            var_1655 = "・金縛りにする空気弾を撃ってくるぞ。";
            var_1656 = "・撃った後は寝てしまうぞ。";
            var_1657 = "・既に金縛りだとダメージ弾になるぞ。";
            var_1658 = "・吉良が近くにいると爆弾空気弾になるぞ。";
        }
        if (var_437 == 122) {
            var_891 = "ﾎﾟﾙﾅﾚﾌ";
            var_967 = 25;
            var_968 = 22;
            var_954 = 1500;
            var_438 = 50;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 305;
            var_1655 = "・２回連続で攻撃してくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 121) {
            var_891 = "花京院";
            var_967 = 26;
            var_968 = 20;
            var_954 = 1400;
            var_438 = 45;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 304;
            var_1655 = "・エメラルドスプラッシュを撃ってくるぞ。";
            var_1656 = "・時々ニセモノが化けているぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 152) {
            var_891 = "ﾄﾘｯｼｭ";
            var_967 = 24;
            var_968 = 24;
            var_954 = 1000;
            var_438 = 40;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 9;
            var_1619 = 508;
            var_1655 = "・柔らかくなってﾀﾞﾒｰｼﾞを受けない事があるぞ。";
            var_1656 = "・柔らかいと後ろに弾んでしまうぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 160) {
            var_891 = "ｳｴｽﾄｳｯﾄﾞ看守";
            var_967 = 27;
            var_968 = 23;
            var_954 = 1000;
            var_438 = 70;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 615;
            var_1655 = "・掴んで動けなくさせるぞ。";
            var_1656 = "・掴んでいると隕石を落とすことがあるぞ。";
            var_1657 = "・この隕石は防御力の影響を受けないぞ。";
            var_1658 = "";
        }
        if (var_437 == 86) {
            var_891 = "ｻﾝﾀﾅ";
            var_967 = 30;
            var_968 = 25;
            var_954 = 1800;
            var_438 = 65;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 205;
            var_1655 = "・空気供給管を通って瞬時に移動するぞ。";
            var_1656 = "・同じ部屋に吸血鬼やゾンビがいると攻撃し、";
            var_1657 = "　やっつけるとレベルが上がるぞ。";
            var_1658 = "";
        }
        if (var_437 == 155) {
            var_891 = "ﾏﾗｲｱ";
            var_967 = 23;
            var_968 = 21;
            var_954 = 1400;
            var_438 = 45;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 347;
            var_1655 = "・付かず離れず距離をとるぞ。";
            var_1656 = "・バステト女神の罠を設置するぞ。";
            var_1657 = "・ボルトやナットを飛ばしてくるぞ。";
            var_1658 = "・磁力がアップしているとダメージが増えるぞ。";
        }
        if (var_437 == 156) {
            var_891 = "ｳｪｻﾞｰ";
            var_967 = 28;
            var_968 = 25;
            var_954 = 1600;
            var_438 = 60;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 610;
            var_1655 = "・弾丸が燃え尽きて届かないぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 157) {
            var_891 = "ｱﾅｽｲ";
            var_967 = 29;
            var_968 = 21;
            var_954 = 1500;
            var_438 = 55;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 614;
            var_1655 = "・同じ部屋にいると壁を通して攻撃するぞ。";
            var_1656 = "・収納アイテムやヤバイものを壊してくるぞ";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 144) {
            var_891 = "川尻浩作";
            var_967 = 32;
            var_968 = 22;
            var_954 = 1700;
            var_438 = 50;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 444;
            var_1655 = "・他人のお金を盗むぞ。";
            var_1656 = "・なんてロマンチックなの……";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 128) {
            var_891 = "承太郎";
            var_967 = 33;
            var_968 = 23;
            var_954 = 1800;
            var_438 = 60;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 403;
            var_1655 = "・ちょっとだけ時間を止めるぞ。";
            var_1656 = "・特定のアイテムを落とすぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 158) {
            var_891 = "ﾌﾟｯﾂﾝ由花子";
            var_967 = 26;
            var_968 = 21;
            var_954 = 1700;
            var_438 = 45;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 434;
            var_1655 = "・髪の毛を飛ばしてくるぞ。";
            var_1656 = "・刺さると思うように動けなくなるぞ。";
            var_1657 = "・ｽﾀﾝﾄﾞDISCに呪縛をかけてくるぞ。";
            var_1658 = "";
        }
        if (var_437 == 150) {
            var_891 = "康一act2!!";
            var_967 = 30;
            var_968 = 22;
            var_954 = 1600;
            var_438 = 40;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 413;
            var_1655 = "・３種類のエコーズを呼び出すぞ。";
            var_1656 = "・杜王町の仲間を呼び出すぞ。";
            var_1657 = "・隣接すると重くなる攻撃をしてくるぞ。";
            var_1658 = "";
        }
        if (var_437 == 68) {
            var_891 = "ﾌﾞﾁ切れた仗助";
            var_967 = 32;
            var_968 = 23;
            var_954 = 1900;
            var_438 = 60;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 402;
            var_1655 = "・倍の速さで移動するぞ。";
            var_1656 = "・２回連続で攻撃するぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 67) {
            var_891 = "ﾌﾞﾁ切れた億泰";
            var_967 = 38;
            var_968 = 25;
            var_954 = 2000;
            var_438 = 70;
            var_1637 = 1;
            var_1654 = 20;
            var_972 = 7;
            var_1619 = 406;
            var_1655 = "・ガオンと近くに引き寄せてくるぞ。";
            var_1656 = "・強烈な一撃を繰り出すことがあるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 151) {
            var_891 = "虫喰い";
            var_967 = 34;
            var_968 = 1;
            var_954 = 1500;
            var_438 = 10;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 6;
            var_1619 = 440;
            var_1655 = "・毒針を発射してくるぞ。";
            var_1656 = "・刺さるとスタンドが溶けて弱まるぞ。";
            var_1657 = "・オーラで強くなっているとオーラが消えるぞ。";
            var_1658 = "・すばやく動いているぞ。";
        }
        if (var_437 == 172) {
            var_891 = "虫食いでない";
            var_967 = 34;
            var_968 = 1;
            var_954 = 1000;
            var_438 = 10;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 6;
            var_1619 = 439;
            var_1655 = "・近づくと毒針を発射してくるぞ。";
            var_1656 = "・刺さるとスタンドが溶けて弱まるぞ。";
            var_1657 = "・オーラで強くなっているとオーラが消えるぞ。";
            var_1658 = "・移動しないぞ。";
        }
        if (var_437 == 87) {
            var_891 = "ｴｼﾃﾞｨｼ";
            var_967 = 38;
            var_968 = 26;
            var_954 = 2200;
            var_438 = 80;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 2;
            var_1619 = 208;
            var_1655 = "・アイテムを消し炭にしてしまうぞ。";
            var_1656 = "・床のアイテムも消し炭にしてしまうぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 164) {
            var_891 = "ｴｼﾃﾞｨｼの脳";
            var_967 = 28;
            var_968 = 80;
            var_954 = 5;
            var_438 = 5;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 2;
            var_1619 = 209;
            var_1655 = "・他の敵に取り付いてレベルを上げるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 109) {
            var_891 = "ワムウ";
            var_967 = 42;
            var_968 = 24;
            var_954 = 2500;
            var_438 = 80;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 2;
            var_1619 = 210;
            var_1655 = "・透明で姿が見えないことがあるぞ。";
            var_1656 = "・瀕死になるとパワーアップするぞ。";
            var_1657 = "・透明かそうでないかで動き方が違うぞ。";
            var_1658 = "";
        }
        if (var_437 == 110) {
            var_891 = "カーズ";
            var_967 = 40;
            var_968 = 23;
            var_954 = 3000;
            var_438 = 75;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 2;
            var_1619 = 214;
            var_1655 = "・２回連続で攻撃してくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 139) {
            var_891 = "ﾘｻﾘｻ";
            var_967 = 45;
            var_968 = 24;
            var_954 = 2800;
            var_438 = 50;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 211;
            var_1655 = "・ヒラリと攻撃をかわしやすいぞ。";
            var_1656 = "・殴ると波紋で痺れることがあるぞ。";
            var_1657 = "・殴られても痺れることがあるぞ。";
            var_1658 = "";
        }
        if (var_437 == 124) {
            var_891 = "ﾐｽﾀ";
            var_967 = 30;
            var_968 = 28;
            var_954 = 2200;
            var_438 = 55;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 9;
            var_1619 = 505;
            var_1655 = "・付かず離れず距離をとるぞ。";
            var_1656 = "・フロア内のどこからでも弾丸を撃ってくるぞ。";
            var_1657 = "・この弾丸は防御力の影響を受けないぞ。";
            var_1658 = "";
        }
        if (var_437 == 154) {
            var_891 = "ｽﾎﾟｰﾂﾏｯｸｽ";
            var_967 = 40;
            var_968 = 25;
            var_954 = 2900;
            var_438 = 60;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 613;
            var_1655 = "・透明で姿が見えないぞ。";
            var_1656 = "・今まで出現した敵を透明にして呼び出すぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 127) {
            var_891 = "C-MOON";
            var_967 = 5;
            var_968 = 30;
            var_954 = 3000;
            var_438 = 75;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 623;
            var_1655 = "・隣接時に裏返り攻撃をしてくるぞ。";
            var_1656 = "・ＨＰの減っている数値が残り数値になるぞ。";
            var_1657 = "・ＨＰが満タンだと１になってしまうぞ。";
            var_1658 = "";
        }
        if (var_437 == 126) {
            var_891 = "退院した花京院";
            var_967 = 45;
            var_968 = 32;
            var_954 = 2900;
            var_438 = 60;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 1;
            var_1619 = 350;
            var_1655 = "・エメラルドスプラッシュを撃ってくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 129) {
            var_891 = "ｱﾇﾋﾞｽﾎﾟﾙﾅﾚﾌ";
            var_967 = 50;
            var_968 = 28;
            var_954 = 3200;
            var_438 = 65;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 346;
            var_1655 = "・２回連続で攻撃してくるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 133) {
            var_891 = "ｳﾞｧﾆﾗｱｲｽ";
            var_967 = 40;
            var_968 = 30;
            var_954 = 2000;
            var_438 = 90;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 2;
            var_1619 = 361;
            var_1655 = "・攻撃を受けるとｸﾘｰﾑの中に入ってしまうぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 159) {
            var_891 = "記憶が戻ったｳｪｻﾞｰ";
            var_967 = 65;
            var_968 = 30;
            var_954 = 3400;
            var_438 = 60;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 621;
            var_1655 = "・弾丸が燃え尽きて届かないぞ。";
            var_1656 = "・攻撃を喰らうと周囲に血の槍を作るぞ。";
            var_1657 = "・カタツムリを呼び出すぞ。";
            var_1658 = "";
        }
        if (var_437 == 170) {
            var_891 = "カタツムリ";
            var_967 = 1;
            var_968 = 1;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 0;
            var_1619 = 622;
            var_1655 = "・触られると鈍足になってしまうぞ。";
            var_1656 = "・見えなければ大丈夫だぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 64) {
            var_891 = "ｷﾞｱｯﾁｮ";
            var_967 = 50;
            var_968 = 40;
            var_954 = 3600;
            var_438 = 50;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 9;
            var_1619 = 517;
            var_1655 = "・倍の速さで移動してくるぞ。";
            var_1656 = "・隣接すると凍らせてくるぞ。";
            var_1657 = "・弾丸やアイテムを凍らせて反射してくるぞ。";
            var_1658 = "";
        }
        if (var_437 == 137) {
            var_891 = "成長した吉良";
            var_967 = 58;
            var_968 = 33;
            var_954 = 3300;
            var_438 = 65;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 7;
            var_1619 = 447;
            var_1655 = "・アイテムを爆弾にしてくるぞ。";
            var_1656 = "・落ちているアイテムも爆弾に変えるぞ。";
            var_1657 = "・仲間を呼び出すぞ。";
            var_1658 = "・瀕死になると第3の爆弾を使うぞ。";
        }
        if (var_437 == 153) {
            var_891 = "ﾏｯｸｲｨｰﾝ";
            var_967 = 20;
            var_968 = 15;
            var_954 = 2000;
            var_438 = 80;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 608;
            var_1655 = "・付かず離れず距離をとるぞ。";
            var_1656 = "・道連れ攻撃で、離れていても攻撃してくるぞ。";
            var_1657 = "・ダメージを与えると反射するぞ。";
            var_1658 = "";
        }
        if (var_437 == 118) {
            var_891 = "ｸﾘｰﾑ";
            var_967 = 70;
            var_968 = 35;
            var_954 = 3300;
            var_438 = 90;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 3;
            var_1619 = 362;
            var_1655 = "・盲目状態で直線的に進むぞ。";
            var_1656 = "・壁を飲み込みながら進むぞ。";
            var_1657 = "・遠くにいてもガオンと近くに来るぞ。";
            var_1658 = "・時々ｳﾞｧﾆﾗｱｲｽが顔を出して位置を確認するぞ。";
        }
        if (var_437 == 114) {
            var_891 = "最高にﾊｲなDIO";
            var_967 = 60;
            var_968 = 34;
            var_954 = 4000;
            var_438 = 90;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 2;
            var_1619 = 365;
            var_1655 = "・さらに長く時間を止めるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 111) {
            var_891 = "究極カーズ";
            var_967 = 70;
            var_968 = 35;
            var_954 = 4400;
            var_438 = 100;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 2;
            var_1619 = 215;
            var_1655 = "・倍の速さで移動するぞ。";
            var_1656 = "・壁があっても自由に動けるぞ。";
            var_1657 = "・壁の中にいると普通の攻撃は効かないぞ。";
            var_1658 = "・攻撃されると波紋で痺れることがあるぞ。";
        }
        if (var_437 == 120) {
            var_891 = "承太郎";
            var_967 = 80;
            var_968 = 30;
            var_954 = 5000;
            var_438 = 90;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 301;
            var_1655 = "・頻繁に強烈な一撃を繰り出すぞ。";
            var_1656 = "・強烈な一撃を喰らうと吹っ飛ぶぞ。";
            var_1657 = "・ﾀﾞﾒｰｼﾞを受けると攻撃力が上がるぞ。";
            var_1658 = "・特定のアイテムを持っているぞ。";
        }
        if (var_437 == 60) {
            var_891 = "ｻﾞ･ﾆｭｰ神父";
            var_967 = 60;
            var_968 = 32;
            var_954 = 5600;
            var_438 = 85;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 624;
            var_1655 = "・倍の速さで移動するぞ。";
            var_1656 = "・２回連続で攻撃するぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 98) {
            var_891 = "ｴﾝﾎﾟﾘｵ";
            var_967 = 70;
            var_968 = 3;
            var_954 = 7;
            var_438 = 7;
            var_1637 = 1;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 625;
            var_1655 = "・純粋酸素で全員にﾀﾞﾒｰｼﾞを与えるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 143) {
            var_891 = "ウンガロ";
            var_967 = 5;
            var_968 = 30;
            var_954 = 10;
            var_438 = 500;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 1;
            var_1619 = 619;
            var_1655 = "・付かず離れず距離をとるぞ。";
            var_1656 = "・マンガのキャラクターを呼び出すぞ。";
            var_1657 = "・自分は攻撃しないぞ。";
            var_1658 = "・ダンジョンの主だぞ。";
        }
        if (var_437 == 166) {
            var_891 = "お母さんヤギ";
            var_967 = 90;
            var_968 = 10;
            var_954 = 10;
            var_438 = 45;
            var_1637 = 0;
            var_1654 = 20;
            var_972 = 3;
            var_1619 = 620;
            var_1655 = "・物語の中から現れたヤギだ。";
            var_1656 = "・付かず離れず距離をとるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 91) {
            var_891 = "ACT1のさなぎ";
            var_967 = 0;
            var_968 = 0;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 8;
            var_1619 = 416;
            var_1655 = "・動かないぞ。";
            var_1656 = "・攻撃もしないぞ。";
            var_1657 = "・エコーズACT2に成長するぞ。";
            var_1658 = "";
        }
        if (var_437 == 92) {
            var_891 = "ACT2のさなぎ";
            var_967 = 0;
            var_968 = 0;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 8;
            var_1619 = 418;
            var_1655 = "・動かないぞ。";
            var_1656 = "・攻撃もしないぞ。";
            var_1657 = "・エコーズACT3に成長するぞ。";
            var_1658 = "";
        }
        if (var_437 == 16) {
            var_891 = "ﾊｲﾌﾟﾘｴｽﾃｽ";
            var_967 = 11;
            var_968 = 8;
            var_954 = 30;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 3;
            var_1619 = 328;
            var_1655 = "・アイテムに化けているぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 130) {
            var_891 = "ﾏﾘﾘﾝﾏﾝｿﾝ";
            var_967 = 10;
            var_968 = 1;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 3;
            var_1619 = 0;
            var_1655 = "";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 146) {
            var_891 = "ﾁｬﾘｵｯﾂ";
            var_967 = 30;
            var_968 = 1;
            var_954 = 40;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 3;
            var_1619 = 306;
            var_1655 = "・分身したチャリオッツだ。";
            var_1656 = "・一撃喰らうと消えてしまうぞ。";
            var_1657 = "・５ターンで消えてしまうぞ。";
            var_1658 = "";
        }
        if (var_437 == 37) {
            var_891 = "猫";
            var_967 = 1;
            var_968 = 1;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 0;
            var_1619 = 803;
            var_1655 = "・にゃー";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 19) {
            var_891 = "ｱﾗﾋﾞｱﾌｧｯﾂ";
            var_967 = 0;
            var_968 = 1;
            var_954 = 110;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 1;
            var_1619 = 323;
            var_1655 = "・岩に化けて動かないぞ。";
            var_1656 = "・太陽のレーザーを発射するぞ。";
            var_1657 = "・気温を上げてレーザーの威力を上げるぞ。";
            var_1658 = "・特定のアイテムを落とすぞ。";
        }
        if (var_437 == 90) {
            var_891 = "岩";
            var_967 = 0;
            var_968 = 1;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 0;
            var_1619 = 324;
            var_1655 = "・岩だ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 96) {
            var_891 = "感電ｴﾝﾎﾟﾘｵ";
            var_967 = 1;
            var_968 = 1;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 1;
            var_1619 = 605;
            var_1655 = "・感電して動けない。";
            var_1656 = "・特定のアイテムを持っているぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 161) {
            var_891 = "橋沢育郎";
            var_967 = 1;
            var_968 = 35;
            var_954 = 1000;
            var_438 = 100;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 801;
            var_1655 = "・攻撃を受けるとバオーに変身するぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 162) {
            var_891 = "バオー";
            var_967 = 100;
            var_968 = 35;
            var_954 = 6000;
            var_438 = 100;
            var_1637 = 0;
            var_1654 = 10;
            var_972 = 1;
            var_1619 = 802;
            var_1655 = "・２回連続で攻撃するぞ。";
            var_1656 = "";
        }
        if (var_437 == 168) {
            var_891 = "警備員の西戸";
            var_967 = 80;
            var_968 = 40;
            var_954 = 100;
            var_438 = 70;
            var_1637 = 0;
            var_1654 = 3;
            var_972 = 1;
            var_1619 = 804;
            var_1655 = "・オレはこのデパートの影の支配者だ！";
            var_1656 = "　悪さをするヤツはゆるさねえ！";
            var_1657 = "・ウワハハハハハ！";
            var_1658 = "・クチャ　クチャ　　ペッ";
        }
        if (var_437 == 33) {
            var_891 = "トニオさん";
            var_967 = 100;
            var_968 = 40;
            var_954 = 1000;
            var_438 = 950;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 435;
            var_1655 = "・お店を守っているぞ。";
            var_1656 = "・攻撃を受けると怒るぞ。";
            var_1657 = "・泥棒すると仲間を呼ぶぞ。";
            var_1658 = "";
        }
        if (var_437 == 34) {
            var_891 = "トニオさん";
            var_967 = 100;
            var_968 = 40;
            var_954 = 1000;
            var_438 = 950;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 7;
            var_1619 = 436;
            var_1655 = "・「タダじゃあおきマセンッ！」";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 61) {
            var_891 = "ﾖｰﾖｰﾏｯ";
            var_967 = 1;
            var_968 = 10;
            var_954 = 100;
            var_438 = 50;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 3;
            var_1619 = 617;
            var_1655 = "・部屋に二人だけになると謎の攻撃をするぞ。";
            var_1656 = "・攻撃すると臭いでﾀﾞﾒｰｼﾞを食らうぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 74) {
            var_891 = "ｻｳﾞｪｼﾞｶﾞｰﾃﾞﾝ";
            var_967 = 1;
            var_968 = 10;
            var_954 = 1;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 612;
            var_1655 = "・アイテムを一つ倉庫に運んでくれるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 75) {
            var_891 = "鮮血のｼｬﾎﾞﾝ";
            var_967 = 1;
            var_968 = 10;
            var_954 = 1;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 213;
            var_1655 = "・アイテムを一つ入れておけるぞ。";
            var_1656 = "・あとで発見した時に取り出せるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 57) {
            var_891 = "SPW財団の男";
            var_967 = 1;
            var_968 = 10;
            var_954 = 1;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 340;
            var_1655 = "・次の階に出現する敵を教えてくれるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 58) {
            var_891 = "ﾎﾞｲﾝｺﾞ";
            var_967 = 1;
            var_968 = 10;
            var_954 = 1;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 4;
            var_1619 = 344;
            var_1655 = "・次の階での死に方を教えてくれるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 55) {
            var_891 = "亀";
            var_967 = 1;
            var_968 = 1;
            var_954 = 1;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 512;
            var_1655 = "・中に部屋があるぞ。";
            var_1656 = "・アイテムを保管しておけるぞ。";
            var_1657 = "・ジッパーにアイテムを捨てると成長し、";
            var_1658 = "　部屋がさらに広くなるぞ。";
        }
        if (var_437 == 53) {
            var_891 = "ｴｸｽﾍﾟﾘｴﾝｽの花";
            var_967 = 1;
            var_968 = 1;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 502;
            var_1655 = "・攻撃を受けるとﾀﾞﾒｰｼﾞを反射するぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 23) {
            var_891 = "ただの死体";
            var_967 = 1;
            var_968 = 1;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 0;
            var_1619 = 321;
            var_1655 = "・とくに何もないぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 81) {
            var_891 = "ｱﾊﾞｯｷｫ";
            var_967 = 1;
            var_968 = 0;
            var_954 = 1;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 504;
            var_1655 = "・ダンジョンから帰還させてくれるぞ。";
            var_1656 = "・お茶を勧めてくれるぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 83) {
            var_891 = "間田";
            var_967 = 1;
            var_968 = 0;
            var_954 = 1;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 4;
            var_1619 = 431;
            var_1655 = "・必ずマンガを持ち歩いているぞ。";
            var_1656 = "・特に「GP BOY」は学校で読むほど大好きだ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 50) {
            var_891 = "元いた場所";
            var_967 = 0;
            var_968 = 0;
            var_954 = 0;
            var_438 = 9999;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 0;
            var_1655 = "";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 116) {
            var_891 = "玉美";
            var_967 = 0;
            var_968 = 1;
            var_954 = 1;
            var_438 = 50;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 7;
            var_1619 = 430;
            var_1655 = "・攻撃すると罪悪感でお金を奪われるぞ。";
            var_1656 = "・すれ違っただけでもお金を奪われるぞ。";
            var_1657 = "・お金がないと体が重くなってしまうぞ。";
            var_1658 = "";
        }
        if (var_437 == 142) {
            var_891 = "露伴";
            var_967 = 10;
            var_968 = 10;
            var_954 = 1;
            var_438 = 20;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 439;
            var_1655 = "・「ﾎﾞﾍﾐｱﾝﾗﾌﾟｿﾃﾞｨのDISC」を探しているぞ。";
            var_1656 = "・岸辺露伴は動かないぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 49) {
            var_891 = "ｺﾋﾟｰ人形";
            var_967 = var_580 + var_565;
            var_968 = var_581;
            var_954 = 0;
            var_438 = var_352;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 5;
            var_1619 = 432;
            var_1655 = "・ウロウロと歩くぞ。";
            var_1656 = "・敵はコピー人形を優先して攻撃するぞ。";
            var_1657 = "・10ターンで人形に戻るぞ。";
            var_1658 = "";
        }
        if (var_437 == 163) {
            var_891 = "ﾔｸ中の少年";
            var_967 = 1;
            var_968 = 0;
            var_954 = 1;
            var_438 = 1;
            var_1637 = 0;
            var_1654 = 1;
            var_972 = 4;
            var_1619 = 509;
            var_1655 = "・フラフラと歩いているぞ。";
            var_1656 = "・ぶん殴ると「やばいクスリ」を落とすぞ。";
            var_1657 = "・中にブチャラティが入っているぞ。";
            var_1658 = "";
        }
        if (var_437 == 36) {
            var_891 = "ｽﾋﾟｰﾄﾞﾜｺﾞﾝ";
            var_967 = 7;
            var_968 = 7;
            var_954 = 0;
            var_438 = 50;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 104;
            var_1655 = "・氷漬けになると助けてくれるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 105) {
            var_891 = "ﾂｪﾍﾟﾘさん";
            var_967 = 9;
            var_968 = 6;
            var_954 = 0;
            var_438 = 40;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 106;
            var_1655 = "・波紋が使える状態にしてくれるぞ。";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 106) {
            var_891 = "ﾍﾟｯｼ";
            var_967 = 4;
            var_968 = 4;
            var_954 = 0;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 514;
            var_1655 = "・ﾋﾞｰﾁﾎﾞｰｲで釣りができるぞ";
            var_1656 = "・兄貴のDISCでパワーアップするぞ。";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 107) {
            var_891 = "成長したﾍﾟｯｼ";
            var_967 = 12;
            var_968 = 12;
            var_954 = 0;
            var_438 = 30;
            var_1637 = 0;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 515;
            var_1655 = "・ﾋﾞｰﾁﾎﾞｰｲで釣りができるぞ";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        if (var_437 == 108) {
            var_891 = "イギー";
            var_967 = 5;
            var_968 = 8;
            var_954 = 0;
            var_438 = 40;
            var_1637 = 1;
            var_1654 = 999;
            var_972 = 4;
            var_1619 = 341;
            var_1655 = "・地面に砂DIOを作ってくれるぞ";
            var_1656 = "";
            var_1657 = "";
            var_1658 = "";
        }
        return;
    });
}