// 死因原因
function func177() {
    return __awaiter(this, void 0, void 0, function* () {
        dbgprt(177);
        var_849 = "「死因設定なし」で";
        var_790 = 0;
        if (var_356 == 0) {
            var_849 = "不正な処理によって";
        }
        if (var_356 == 1) {
            var_849 = "ﾔｸ中のｺﾞﾛﾂｷに刺されて";
        }
        if (var_356 == 2) {
            var_849 = "ﾇｹｻｸに噛まれて";
        }
        if (var_356 == 3) {
            var_849 = "ﾀﾜｰｵﾌﾞｸﾞﾚｰに舌を抜かれて";
        }
        if (var_356 == 4) {
            var_849 = "ﾃﾞｽ13に胴体真っ二つにされて";
        }
        if (var_356 == 5) {
            var_849 = "小汚い浮浪者に刺されて";
        }
        if (var_356 == 6) {
            var_849 = "ｴﾎﾞﾆｰﾃﾞﾋﾞﾙの人形に○○を噛み切られ";
        }
        if (var_356 == 7) {
            var_849 = "運命の車輪にひき肉にしてﾌﾞﾁまけられ";
        }
        if (var_356 == 8) {
            var_849 = "無愛想親父の死体にﾁｭｰﾁｭｰ吸われて";
        }
        if (var_356 == 9) {
            var_849 = "ﾗﾊﾞｰｿｳﾙに口の中にｸｿをつめこまれて";
        }
        if (var_356 == 10) {
            var_849 = "ﾉﾄｰﾘｱｽBIGに喰われて";
        }
        if (var_356 == 11) {
            var_849 = "ﾜｲｱｰﾄﾞのﾍﾞｯｸにお仕置きされて";
        }
        if (var_356 == 12) {
            var_849 = "ｴｺｰｽﾞACT3に殴られて";
        }
        if (var_356 == 13) {
            var_849 = "ﾗﾊﾞｰｽﾞに脳みそをえぐられて";
        }
        if (var_356 == 14) {
            var_849 = "ｶｰﾝにぶった切られて";
        }
        if (var_356 == 15) {
            var_849 = "ﾍﾟｯﾄｼｮｯﾌﾟに喰われて";
        }
        if (var_356 == 16) {
            var_849 = "ﾊｲﾌﾟﾘｴｽﾃｽに引き裂かれて";
        }
        if (var_356 == 17) {
            var_849 = "ｼｱｰﾊｰﾄｱﾀｯｸにｶﾞﾎﾞｵｯと突っ込まれ";
        }
        if (var_356 == 18) {
            var_849 = "ﾌﾞﾗｯｸ･ｻﾊﾞｽに矢で突き刺されて";
        }
        if (var_356 == 19) {
            var_849 = "暑さで おつむがやられちまって";
        }
        if (var_356 == 20) {
            var_849 = "ｴﾝﾔ婆に背骨バキ折られて";
        }
        if (var_356 == 21) {
            var_849 = "ｽﾄﾚｲ･ｷｬｯﾄにひっかかれて";
        }
        if (var_356 == 22) {
            var_849 = "ｱｳﾞﾄﾞｩﾙの土人形に喰われて";
        }
        if (var_356 == 23) {
            var_849 = "ただの死体にやられて";
        }
        if (var_356 == 24) {
            var_849 = "穴ﾎﾞｺﾁｰｽﾞの死体にﾁｭｰﾁｭｰ吸われて";
        }
        if (var_356 == 25) {
            var_849 = "子連れﾆｷﾋﾞの死体にﾁｭｰﾁｭｰ吸われて";
        }
        if (var_356 == 26) {
            var_849 = "ﾊｰｳﾞｪｽﾄに細かくきざまれて";
        }
        if (var_356 == 27) {
            var_849 = "ｹﾞﾌﾞ神に切り裂かれて";
        }
        if (var_356 == 28) {
            var_849 = "ｼﾞｬｯｼﾞﾒﾝﾄに殴られて";
        }
        if (var_356 == 29) {
            var_849 = "ｸﾞﾘｰﾝ･ﾃﾞｨにｶﾋﾞｶﾋﾞにされて";
        }
        if (var_356 == 30) {
            var_849 = "禁煙中ﾎﾙ･ﾎｰｽにｴﾝｽﾞｲ蹴りをくらって";
        }
        if (var_356 == 31) {
            var_849 = "吉良の親父に首を飛ばされて";
        }
        if (var_356 == 32) {
            var_849 = "吉良吉影にドテっ腹に穴をあけられ";
        }
        if (var_356 == 33) {
            var_849 = "ﾄﾆｵさんに石鹸で殴られて";
        }
        if (var_356 == 34) {
            var_849 = "ﾄﾆｵさんに石鹸で殴られて";
        }
        if (var_356 == 35) {
            var_849 = "仗助にドララ―ッと殴られて";
        }
        if (var_356 == 36) {
            var_849 = "ｽﾋﾟｰﾄﾞﾜｺﾞﾝにやられて";
        }
        if (var_356 == 37) {
            var_849 = "猫に引っ掻かれて";
        }
        if (var_356 == 38) {
            var_849 = "ｱﾚｯｼｰに斧で切られて";
        }
        if (var_356 == 39) {
            var_849 = "ﾊｲｳｪｲ･ｽﾀｰに養分を吸い取られ";
        }
        if (var_356 == 40) {
            var_849 = "ﾊﾞｯﾄﾞ･ｶﾝﾊﾟﾆｰにやられて";
        }
        if (var_356 == 41) {
            var_849 = "ﾊﾞｯﾄﾞ･ｶﾝﾊﾟﾆｰの戦車にやられて";
        }
        if (var_356 == 42) {
            var_849 = "ｱﾊﾟｯﾁにやられて";
        }
        if (var_356 == 43) {
            var_849 = "ｾｯｺに溶かされて";
        }
        if (var_356 == 44) {
            var_849 = "ﾚｯﾄﾞﾎｯﾄﾁﾘﾍﾟｯﾊﾟｰに焦がされて";
        }
        if (var_356 == 45) {
            var_849 = "由花子にﾁﾝﾎﾟｺ引っこ抜かれて";
        }
        if (var_356 == 46) {
            var_849 = "ﾎﾙ･ﾎｰｽに脳みそ床にブチ撒けられて";
        }
        if (var_356 == 47) {
            var_849 = "ｻﾞ･ﾊﾝﾄﾞに削り取られて";
        }
        if (var_356 == 48) {
            var_849 = "ｴｱﾛｽﾐｽのﾌﾟﾛﾍﾟﾗに切られて";
        }
        if (var_356 == 49) {
            var_849 = "ｺﾋﾟｰ人形に殴られて";
        }
        if (var_356 == 50) {
            var_849 = "過去のディアボロにやられて";
        }
        if (var_356 == 51) {
            var_849 = "ﾜﾝﾁｪﾝに切り裂かれて";
        }
        if (var_356 == 52) {
            var_849 = "ｼﾞｬｯｸ･ｻﾞ･ﾘﾊﾟｰに切り裂かれて";
        }
        if (var_356 == 53) {
            var_849 = "G･ｴｸｽﾍﾟﾘｴﾝｽの花にやられて";
        }
        if (var_356 == 54) {
            var_849 = "ｸﾞﾘｰﾝﾍﾞﾚｰにｻﾞｸﾞｻﾞｸ刺されて";
        }
        if (var_356 == 55) {
            var_849 = "亀にやられて";
        }
        if (var_356 == 56) {
            var_849 = "ｼｭﾄﾛﾊｲﾑに1ｾﾝﾁ四方の肉片にされて";
        }
        if (var_356 == 57) {
            var_849 = "SPW財団の男にやられて";
        }
        if (var_356 == 58) {
            var_849 = "ﾎﾞｲﾝｺﾞにやられて";
        }
        if (var_356 == 59) {
            var_849 = "ﾌﾟｯﾁ神父に磔刑にされて";
        }
        if (var_356 == 60) {
            var_849 = "ｻﾞ･ﾆｭｰ神父に顔面を切り裂かれて";
        }
        if (var_356 == 61) {
            var_849 = "ﾖｰﾖｰﾏｯの謎の攻撃を喰らって";
        }
        if (var_356 == 62) {
            var_849 = "ﾍﾞｲﾋﾞｨﾌｪｲｽに分解されて";
        }
        if (var_356 == 63) {
            var_849 = "ﾌﾟﾛｼｭｰﾄ兄貴にﾖﾎﾞﾖﾎﾞにされて";
        }
        if (var_356 == 64) {
            var_849 = "ｷﾞｱｯﾁｮに凍らされて";
        }
        if (var_356 == 65) {
            var_849 = "形兆に顔中穴だらけにされて";
        }
        if (var_356 == 66) {
            var_849 = "ﾀﾙｶｽに雑巾絞りにされて";
        }
        if (var_356 == 67) {
            var_849 = "ﾌﾞﾁ切れた億泰に削られて";
        }
        if (var_356 == 68) {
            var_849 = "ﾌﾞﾁ切れた仗助に殴られて";
        }
        if (var_356 == 69) {
            var_849 = "ﾌﾞﾗﾌｫｰﾄﾞの死髪舞剣にやられて";
        }
        if (var_356 == 70) {
            var_849 = "ﾀﾞｰﾋﾞｰにやられて";
        }
        if (var_356 == 71) {
            var_849 = "ﾄﾞｩｰﾋﾞｰの蛇にﾙﾝﾙﾝ噛まれて";
        }
        if (var_356 == 72) {
            var_849 = "ｹﾝｿﾞｰに膨らまされて";
        }
        if (var_356 == 73) {
            var_849 = "かかったなアホが！";
        }
        if (var_356 == 74) {
            var_849 = "ｻｳﾞｪｼﾞｶﾞｰﾃﾞﾝにやられて";
        }
        if (var_356 == 75) {
            var_849 = "鮮血のｼｬﾎﾞﾝにやられて";
        }
        if (var_356 == 76) {
            var_849 = "ｴｺｰｽﾞACT2に吹っ飛ばされて";
        }
        if (var_356 == 77) {
            var_849 = "ｴｺｰｽﾞACT1に鼓膜を破壊され";
        }
        if (var_356 == 78) {
            var_849 = "ｱｳﾞﾄﾞｩﾙさんにケシ炭にされて";
        }
        if (var_356 == 79) {
            var_849 = "ｴｺｰｽﾞの卵にぶつかられて";
        }
        if (var_356 == 80) {
            var_849 = "ﾗﾝｸﾞ･ﾗﾝｸﾞﾗｰに血液沸騰させられて";
        }
        if (var_356 == 81) {
            var_849 = "ｱﾊﾞｯｷｫにやられて";
        }
        if (var_356 == 82) {
            var_849 = "バーテンにやられて";
        }
        if (var_356 == 83) {
            var_849 = "間田にやられて";
        }
        if (var_356 == 84) {
            var_849 = "ﾁｮｺﾗｰﾀに解剖されて";
        }
        if (var_356 == 85) {
            var_849 = "ﾘｿﾞｯﾄに鉄分全部奪われて";
        }
        if (var_356 == 86) {
            var_849 = "ｻﾝﾀﾅに負け犬ムードのまま";
        }
        if (var_356 == 87) {
            var_849 = "ｴｼﾃﾞｨｼにｸﾞﾂｸﾞﾂのｼﾁｭｰにされて";
        }
        if (var_356 == 88) {
            var_849 = "ﾄﾞﾉｳﾞｧﾝに軽々とかわされて";
        }
        if (var_356 == 89) {
            var_849 = "ﾌｫｰｴﾊﾞｰに殴られて";
        }
        if (var_356 == 90) {
            var_849 = "岩にやられて";
        }
        if (var_356 == 91) {
            var_849 = "ACT1のさなぎにやられて";
        }
        if (var_356 == 92) {
            var_849 = "ACT2のさなぎにやられて";
        }
        if (var_356 == 93) {
            var_849 = "ｴﾝﾎﾟﾘｵにやられて";
        }
        if (var_356 == 94) {
            var_849 = "ブルりんの見せ場にされて";
        }
        if (var_356 == 95) {
            var_849 = "あーん！ｽﾄ様にやられて";
        }
        if (var_356 == 96) {
            var_849 = "感電中のｴﾝﾎﾟﾘｵにやられて";
        }
        if (var_356 == 97) {
            var_849 = "ｵｲﾝｺﾞにだまされて";
        }
        if (var_356 == 98) {
            var_849 = "ｴﾝﾎﾟﾘｵ･ｳｪｻﾞｰに頭をブッ潰されて";
        }
        if (var_356 == 99) {
            var_849 = "ﾏﾝﾊｯﾀﾝﾄﾗﾝｽﾌｧｰにﾌﾜﾌﾜかわされて";
        }
        if (var_356 == 100) {
            var_849 = "家出少女にやられて";
        }
        if (var_356 == 101) {
            var_849 = "ﾍﾟｲｼﾞの血管針攻撃で";
        }
        if (var_356 == 102) {
            var_849 = "ｼﾞｮｰﾝｽﾞの血管針攻撃で";
        }
        if (var_356 == 103) {
            var_849 = "ﾌﾟﾗﾝﾄの血管針攻撃で";
        }
        if (var_356 == 104) {
            var_849 = "ﾎﾞｰﾝﾅﾑの血管針攻撃で";
        }
        if (var_356 == 105) {
            var_849 = "ﾂｪﾍﾟﾘさんにメメタァと殴られて";
        }
        if (var_356 == 106) {
            var_849 = "ﾍﾟｯｼに釣られて";
        }
        if (var_356 == 107) {
            var_849 = "成長したﾍﾟｯｼに心臓を釣られて";
        }
        if (var_356 == 108) {
            var_849 = "イギーに顔面噛み砕かれて";
        }
        if (var_356 == 109) {
            var_849 = "戦闘の天才ということを思い知らされ";
        }
        if (var_356 == 110) {
            var_849 = "カーズにうめき声をあげる暇もなく";
        }
        if (var_356 == 111) {
            var_849 = "究極カーズに手も足も出ず";
        }
        if (var_356 == 112) {
            var_849 = "砂のDIOに背後からやられ";
        }
        if (var_356 == 113) {
            var_849 = "DIOに腹をﾌﾞﾁ抜かれて";
        }
        if (var_356 == 114) {
            var_849 = "最高にﾊｲなDIOの無駄無駄を喰らい";
        }
        if (var_356 == 115) {
            var_849 = "ｱｸｱ･ﾈｯｸﾚｽに体内に入り込まれて";
        }
        if (var_356 == 116) {
            var_849 = "玉美に罪悪感を持って";
        }
        if (var_356 == 117) {
            var_849 = "ﾁｮｺﾗｰﾀの上半身に解剖されて";
        }
        if (var_356 == 118) {
            var_849 = "こなみじんになって";
        }
        if (var_356 == 119) {
            var_849 = "戦いの年季の違いを思い知らされ";
        }
        if (var_356 == 120) {
            var_849 = "承太郎に再起不能にされ";
        }
        if (var_356 == 121) {
            var_849 = "仲直りの握手の代わりを喰らい";
        }
        if (var_356 == 122) {
            var_849 = "ﾎﾟﾙﾅﾚﾌに串刺しにされて";
        }
        if (var_356 == 123) {
            var_849 = "ﾌﾞﾁｬﾗﾃｨにバラバラにされて";
        }
        if (var_356 == 124) {
            var_849 = "ﾐｽﾀに銃で殴られて";
        }
        if (var_356 == 125) {
            var_849 = "ﾌｰｺﾞにｸｻﾚ脳ﾐｿと罵られつつ";
        }
        if (var_356 == 126) {
            var_849 = "退院した花京院に殴られて";
        }
        if (var_356 == 127) {
            var_849 = "C-MOONに裏返させられ";
        }
        if (var_356 == 128) {
            var_849 = "４部承太郎にブン殴られて";
        }
        if (var_356 == 129) {
            var_849 = "ｱﾇﾋﾞｽﾎﾟﾙﾅﾚﾌに切り刻まれ";
        }
        if (var_356 == 130) {
            var_849 = "ﾏﾘﾘﾝﾏﾝｿﾝにやられて";
        }
        if (var_356 == 131) {
            var_849 = "ｼﾞｮﾙﾉに殴られ精神だけ暴走し";
        }
        if (var_356 == 132) {
            var_849 = "ﾚｸｲｴﾑｼﾞｮﾙﾉにまたやられて";
        }
        if (var_356 == 133) {
            var_849 = "ｳﾞｧﾆﾗｱｲｽに蹴り殺されて";
        }
        if (var_356 == 134) {
            var_849 = "ｼﾞｮﾘｰﾝに決着ゥつけられて";
        }
        if (var_356 == 135) {
            var_849 = "若ｼﾞｮｾﾌの策に敗れて";
        }
        if (var_356 == 136) {
            var_849 = "ｼｰｻﾞｰに「波紋蹴り」で攻撃され";
        }
        if (var_356 == 137) {
            var_849 = "成長した吉良に爆死させられ";
        }
        if (var_356 == 138) {
            var_849 = "ﾃﾞｨｵの傷を薫蒸消毒させられ";
        }
        if (var_356 == 139) {
            var_849 = "ｵｰﾉｰだｽﾞﾗ　ﾘｻﾘｻに波紋を流されて";
        }
        if (var_356 == 140) {
            var_849 = "ｼﾞｮﾅｻﾝに貫かれて";
        }
        if (var_356 == 141) {
            var_849 = "F・Fに力ずくでねじふせられ";
        }
        if (var_356 == 142) {
            var_849 = "露伴にやられて";
        }
        if (var_356 == 143) {
            var_849 = "ｳﾝｶﾞﾛに敗れて";
        }
        if (var_356 == 144) {
            var_849 = "川尻浩作に耳だけ残して爆破され";
        }
        if (var_356 == 145) {
            var_849 = "康一に重くさせられて";
        }
        if (var_356 == 146) {
            var_849 = "ﾁｬﾘｵｯﾂの剣さばきを見せられ";
        }
        if (var_356 == 147) {
            var_849 = "四部ｼﾞｮｾﾌにやられて";
        }
        if (var_356 == 148) {
            var_849 = "ｴﾙﾒｪｽにｸﾞﾛﾘｱのぶんも復讐されて";
        }
        if (var_356 == 149) {
            var_849 = "幽霊のﾎﾟﾙﾅﾚﾌにやられて";
        }
        if (var_356 == 150) {
            var_849 = "康一ACT2!!に敗北感を感じて";
        }
        if (var_356 == 151) {
            var_849 = "虫喰いに噛まれて";
        }
        if (var_356 == 152) {
            var_849 = "ﾄﾘｯｼｭに細切れに切り刻まれて";
        }
        if (var_356 == 153) {
            var_849 = "ﾏｯｸｲｨｰﾝに関わって";
        }
        if (var_356 == 154) {
            var_849 = "ｽﾎﾟｰﾂﾏｯｸｽに噛み付かれて";
        }
        if (var_356 == 155) {
            var_849 = "追いつめたつもりが追いつめられて";
        }
        if (var_356 == 156) {
            var_849 = "ｳｪｻﾞｰﾘﾎﾟｰﾄにｳｪｻﾞｰﾘﾎﾟｰﾄで殴られ";
        }
        if (var_356 == 157) {
            var_849 = "ｱﾅｽｲに解体されて";
        }
        if (var_356 == 158) {
            var_849 = "ﾌﾟｯﾂﾝ由花子に荒っぽいことをされて";
        }
        if (var_356 == 159) {
            var_849 = "記憶が戻ったｳｪｻﾞｰに殴られ";
        }
        if (var_356 == 160) {
            var_849 = "ｳｴｽﾄｳｯﾄﾞ看守にキレまくられて";
        }
        if (var_356 == 161) {
            var_849 = "橋沢育郎に殴られて";
        }
        if (var_356 == 162) {
            var_849 = "バオーに触れて";
        }
        if (var_356 == 163) {
            var_849 = "ﾔｸ中の少年にやられて";
        }
        if (var_356 == 164) {
            var_849 = "ｴｼﾃﾞｨｼの脳に憑りつかれて";
        }
        if (var_356 == 165) {
            var_849 = "ｴﾎﾞﾆｰﾃﾞﾋﾞﾙに切られて";
        }
        if (var_356 == 166) {
            var_849 = "お母さんヤギに切り裂かれて";
        }
        if (var_356 == 167) {
            var_849 = "ダニーにやられて";
        }
        if (var_356 == 168) {
            var_849 = "ｶﾞﾑを尻の穴につめられて";
        }
        if (var_356 == 169) {
            var_849 = "公一くんにやられて";
        }
        if (var_356 == 170) {
            var_849 = "カタツムリにされて";
        }
        if (var_356 == 171) {
            var_849 = "ワムウの首にやられて";
        }
        if (var_356 == 172) {
            var_849 = "虫喰いでないににこごりにされ";
        }
        if (var_356 == 173) {
            var_849 = "ﾛｯｺ･ﾊﾞﾛｯｺ所長にやられて";
        }
        if (var_356 == 174) {
            var_849 = "ディアボロにやられて";
        }
        if (var_356 == 175) {
            var_849 = "ﾁｬｶにブッた切られて";
        }
        if (var_829 == 1 && var_356 >= 1 && var_356 < 200) {
            var_830 = var_356;
        }
        if (var_356 == 200) {
            var_849 = "便器をなめるように綺麗にさせられ";
        }
        if (var_356 == 201) {
            var_849 = "空腹のため";
        }
        if (var_356 == 202) {
            var_849 = "波紋で溶かされて";
        }
        if (var_356 == 203) {
            var_849 = "ﾉﾄｰﾘｱｽBIGの肉片に喰われて";
            if (var_829 == 1) {
                var_830 = 10;
            }
        }
        if (var_356 == 204) {
            var_849 = "ﾃﾝﾊﾟﾗﾝｽの肉片に喰われて";
            if (var_829 == 1) {
                var_830 = 9;
            }
        }
        if (var_356 == 205) {
            var_849 = "運命の車輪にｶﾞｿﾘﾝを撃たれて";
            if (var_829 == 1) {
                var_830 = 7;
            }
        }
        if (var_356 == 206) {
            var_849 = "氷のﾐｻｲﾙを撃たれて";
            if (var_829 == 1) {
                var_830 = 15;
            }
        }
        if (var_356 == 207) {
            var_849 = "太陽のﾚｰｻﾞｰに撃たれて";
            if (var_829 == 1) {
                var_830 = 19;
            }
        }
        if (var_356 == 208) {
            var_849 = "暑さで おつむがやられちまって";
            if (var_829 == 1) {
                var_830 = 19;
            }
        }
        if (var_356 == 209) {
            var_849 = "ｼｱｰﾊｰﾄｱﾀｯｸが爆発して";
            if (var_829 == 1) {
                var_830 = 17;
            }
        }
        if (var_356 == 210) {
            var_849 = "神砂嵐に巻き込まれて";
        }
        if (var_356 == 211) {
            var_849 = "猫草の空気弾に胸をえぐられて";
            if (var_829 == 1) {
                var_830 = 21;
            }
        }
        if (var_356 == 212) {
            var_849 = "ﾁｰﾌﾟ･ﾄﾘｯｸのせいで精神が崩壊して";
        }
        if (var_356 == 213) {
            var_849 = "ｱﾚｯｼｰに胎児まで戻されて";
            if (var_829 == 1) {
                var_830 = 38;
            }
        }
        if (var_356 == 214) {
            var_849 = "由花子の髪の毛を刺されて";
            if (var_829 == 1) {
                var_830 = 0;
            }
        }
        if (var_356 == 215) {
            var_849 = "ｴﾝﾍﾟﾗｰの弾丸を脳天に喰らって";
            if (var_829 == 1) {
                var_830 = 46;
            }
        }
        if (var_356 == 216) {
            var_849 = "ｴｱﾛｽﾐｽの弾丸を喰らって";
            if (var_829 == 1) {
                var_830 = 48;
            }
        }
        if (var_356 == 217) {
            var_849 = "ｷﾗｰｸｨｰﾝの爆弾を喰らって";
            if (var_829 == 1) {
                var_830 = 0;
            }
        }
        if (var_356 == 218) {
            var_849 = "ﾊﾞｯﾄﾞｶﾝﾊﾟﾆｰの弾丸を喰らって";
            if (var_829 == 1) {
                var_830 = 40;
            }
        }
        if (var_356 == 219) {
            var_849 = "戦車の砲弾を喰らって";
            if (var_829 == 1) {
                var_830 = 41;
            }
        }
        if (var_356 == 220) {
            var_849 = "ｱﾊﾟｯﾁのﾐｻｲﾙを喰らって";
            if (var_829 == 1) {
                var_830 = 42;
            }
        }
        if (var_356 == 221) {
            var_849 = "ｼｭﾄﾛﾊｲﾑに肉片まで細切れにされて";
            if (var_829 == 1) {
                var_830 = 56;
            }
        }
        if (var_356 == 222) {
            var_849 = "ﾖｰﾖｰﾏｯの謎の攻撃を喰らって";
            if (var_829 == 1) {
                var_830 = 61;
            }
        }
        if (var_356 == 223) {
            var_849 = "ｼﾞｪﾝﾄﾘｰｳｨｰﾌﾟｽで攻撃を跳ね返され";
            if (var_829 == 1) {
                var_830 = 64;
            }
        }
        if (var_356 == 224) {
            var_849 = "吹っ飛んだ衝撃で";
        }
        if (var_356 == 225) {
            var_849 = "体内の鉄分が無くなって";
            if (var_829 == 1) {
                var_830 = 85;
            }
        }
        if (var_356 == 226) {
            var_849 = "壁の中で力尽きて";
        }
        if (var_356 == 227) {
            var_849 = "幽霊の弾丸を喰らって";
            if (var_829 == 1) {
                var_830 = 93;
            }
        }
        if (var_356 == 228) {
            var_849 = "空烈眼刺驚を喰らって";
            if (var_829 == 1) {
                var_830 = 95;
            }
        }
        if (var_356 == 229) {
            var_849 = "電気が水に散って";
        }
        if (var_356 == 230) {
            var_849 = "ﾀﾞｲﾊﾞｰﾀﾞｳﾝに殴られて";
        }
        if (var_356 == 231) {
            var_849 = "ﾛｰﾘﾝｸﾞｽﾄｰﾝｽﾞに押しつぶされて";
        }
        if (var_356 == 232) {
            var_849 = "ﾜﾑｳに蹴られて";
        }
        if (var_356 == 233) {
            var_849 = "ﾛｰﾄﾞﾛｰﾗｰにぶっ潰されて";
        }
        if (var_356 == 234) {
            var_849 = "ﾊﾞｯﾄﾞｶﾝﾊﾟﾆｰの地雷を踏んづけて";
        }
        if (var_356 == 235) {
            var_849 = "自分の撃った弾丸があたって";
        }
        if (var_356 == 236) {
            var_849 = "磁力で飛んできた物にあたって";
        }
        if (var_356 == 237) {
            var_849 = "吹き飛ばされた衝撃で";
        }
        if (var_356 == 238) {
            var_849 = "ﾊﾝｸﾞﾄﾞﾏﾝに刺されて";
        }
        if (var_356 == 239) {
            var_849 = "ｴﾒﾗﾙﾄﾞｽﾌﾟﾗｯｼｭを喰らって";
            if (var_829 == 1) {
                var_830 = 121;
            }
        }
        if (var_356 == 240) {
            var_849 = "ﾋﾟｽﾄﾙｽﾞの弾丸を喰らって";
            if (var_829 == 1) {
                var_830 = 124;
            }
        }
        if (var_356 == 241) {
            var_849 = "殺人ｳｨﾙｽに感染して";
            if (var_829 == 1) {
                var_830 = 125;
            }
        }
        if (var_356 == 242) {
            var_849 = "虫喰いのﾗｯﾄの針が刺さって";
            if (var_829 == 1) {
                var_830 = 151;
            }
        }
        if (var_356 == 243) {
            var_849 = "サソリに刺されて";
            if (var_829 == 1) {
                var_830 = 132;
            }
        }
        if (var_356 == 244) {
            var_849 = "F・F弾を喰らって";
            if (var_829 == 1) {
                var_830 = 141;
            }
        }
        if (var_356 == 245) {
            var_849 = "ﾍﾌﾞﾝｽﾞﾄﾞｱｰで自ら吹っ飛んで";
        }
        if (var_356 == 246) {
            var_849 = "ﾏﾝﾊｯﾀﾝﾄﾗﾝｽﾌｧｰの弾丸を喰らって";
            if (var_829 == 1) {
                var_830 = 99;
            }
        }
        if (var_356 == 247) {
            var_849 = "首吊り自殺して";
        }
        if (var_356 == 248) {
            var_849 = "爆風のダメージで";
        }
        if (var_356 == 249) {
            var_849 = "アイテムが爆発して";
        }
        if (var_356 == 250) {
            var_849 = "欲張りすぎて";
        }
        if (var_356 == 251) {
            var_849 = "純粋酸素の部屋で";
            if (var_829 == 1) {
                var_830 = 98;
            }
        }
        if (var_356 == 252) {
            var_849 = "臭くて";
            if (var_829 == 1) {
                var_830 = 61;
            }
        }
        if (var_356 == 253) {
            var_849 = "道連れにされて";
            if (var_829 == 1) {
                var_830 = 153;
            }
        }
        if (var_356 == 254) {
            var_849 = "ﾎﾞﾙﾄやﾅｯﾄを喰らって";
            if (var_829 == 1) {
                var_830 = 155;
            }
        }
        if (var_356 == 255) {
            var_849 = "道連れにされて";
            if (var_829 == 1) {
                var_830 = 153;
            }
        }
        if (var_356 == 256) {
            var_849 = "憎き肉片に喰われて";
            if (var_829 == 1) {
                var_830 = 86;
            }
        }
        if (var_356 == 257) {
            var_849 = "隕石が直撃して";
            if (var_829 == 1) {
                var_830 = 160;
            }
        }
        if (var_356 == 258) {
            var_849 = "レクイエムの能力を解除して";
            var_790 = 2;
        }
        if (var_356 == 259) {
            var_849 = "時の止まった世界でDIOにやられ";
            if (var_829 == 1) {
                var_830 = 113;
            }
        }
        if (var_356 == 260) {
            var_849 = "ﾔﾄﾞｸｶﾞｴﾙを食べて";
        }
        if (var_356 == 261) {
            var_849 = "ﾗｯﾄの針で溶けて";
        }
        if (var_356 == 262) {
            var_849 = "ズームパンチを喰らって";
            if (var_829 == 1) {
                var_830 = 140;
            }
        }
        if (var_356 == 263) {
            var_849 = "ｴﾝﾍﾟﾗｰの弾丸を予知通り喰らって";
            if (var_829 == 1) {
                var_830 = 30;
            }
        }
        if (var_356 == 264) {
            var_849 = "ｼｬﾎﾞﾝﾗﾝﾁｬｰを喰らって";
            if (var_829 == 1) {
                var_830 = 136;
            }
        }
        if (var_356 == 265) {
            var_849 = "上院議員を喰らって";
            if (var_829 == 1) {
                var_830 = 113;
            }
        }
        if (var_356 == 266) {
            var_849 = "DISCの命令で破裂して";
        }
        if (var_356 == 267) {
            var_849 = "飛んできたカナヅチにあたって";
        }
        if (var_356 == 268) {
            var_849 = "飛んできたカンヅメにあたって";
        }
        if (var_356 == 269) {
            var_849 = "飛んできたラジカセにあたって";
        }
        if (var_356 == 270) {
            var_849 = "飛んできた刃物が刺さって";
        }
        if (var_356 == 271) {
            var_849 = "飛んできた自転車にあたって";
        }
        if (var_356 == 272) {
            var_849 = "飛んできたアブドゥルにあたって";
        }
        if (var_356 == 273) {
            var_849 = "飛んできた車にあたって";
        }
        if (var_356 == 274) {
            var_849 = "強力なｴﾒﾗﾙﾄﾞｽﾌﾟﾗｯｼｭを喰らって";
            if (var_829 == 1) {
                var_830 = 126;
            }
        }
        if (var_356 == 275) {
            var_849 = "釣り針が刺さって";
            if (var_829 == 1) {
                var_830 = 106;
            }
        }
        if (var_356 == 276) {
            var_849 = "釣り針が心臓に刺さって";
            if (var_829 == 1) {
                var_830 = 107;
            }
        }
        if (var_356 == 277) {
            var_849 = "磁力ではさみうちにされて";
        }
        if (var_356 == 278) {
            var_849 = "エコーズの文字の衝撃で";
            if (var_829 == 1) {
                var_830 = 76;
            }
        }
        if (var_356 == 279) {
            var_849 = "電話待ってます";
        }
        if (var_356 == 280) {
            var_849 = "先輩が注いでくれたお茶を飲んで";
            if (var_829 == 1) {
                var_830 = 81;
            }
        }
        if (var_356 == 281) {
            var_849 = "西戸にチェーンで殴られて";
            if (var_829 == 1) {
                var_830 = 168;
            }
        }
        if (var_356 == 282) {
            var_849 = "血の槍の罠を踏んで";
            if (var_829 == 1) {
                var_830 = 159;
            }
        }
        if (var_356 == 283) {
            var_849 = "自分でバラバラになって";
        }
        if (var_356 == 284) {
            var_849 = "時の止まった世界でﾊｲなDIOにやられ";
            if (var_829 == 1) {
                var_830 = 114;
            }
        }
        if (var_356 == 285) {
            var_849 = "ﾀﾞｲﾊﾞｰﾀﾞｳﾝの潜水攻撃を喰らって";
            if (var_829 == 1) {
                var_830 = 157;
            }
        }
        if (var_356 == 286) {
            var_849 = "虫喰いでないのﾗｯﾄの針が刺さって";
            if (var_829 == 1) {
                var_830 = 172;
            }
        }
        if (var_356 == 287) {
            var_849 = "ﾁｬｶの透過攻撃でまっぷたつにされて";
            if (var_829 == 1) {
                var_830 = 175;
            }
        }
        if (var_356 != 73 && var_356 != 279) {
            var_798 = var_849 + "死亡";
        }
        if (var_356 == 73) {
            var_798 = var_849;
        }
        if (var_356 == 279) {
            var_798 = var_849;
        }
        if (var_356 == 300) {
            var_798 = "ダンジョンから帰還";
            var_790 = 1;
        }
        if (var_356 == 301) {
            var_798 = "エンヤホテルを制覇して無事に帰る";
            var_790 = 2;
        }
        if (var_356 == 302) {
            var_798 = "レクイエムの大迷宮を制覇して無事に帰る";
            var_790 = 2;
        }
        if (var_356 == 303) {
            var_798 = "ディアボロの試練を制覇して無事に帰る";
            var_790 = 2;
        }
        if (var_356 == 305) {
            var_798 = "考えるのをやめた";
        }
        if (var_356 == 306) {
            var_798 = "ｳﾞｪﾈﾂｨｱ･ﾎﾃﾙの自室から帰還";
            var_790 = 1;
        }
        if (var_356 == 307) {
            var_798 = "ホテルの外から帰還";
            var_790 = 1;
        }
        if (var_356 == 308) {
            var_798 = "レクイエムの大迷宮から帰還";
            var_790 = 1;
        }
        if (var_356 == 309) {
            var_798 = "ディアボロの試練から帰還";
            var_790 = 1;
        }
        if (var_356 == 310) {
            var_798 = "一巡後の世界から帰還";
            var_790 = 1;
        }
        if (var_356 == 311) {
            var_798 = "ﾑｰﾃﾞｨｰﾌﾞﾙｰｽで帰還";
            var_790 = 1;
        }
        if (var_356 == 312) {
            var_798 = "ｱｲﾃﾑを持ち込まずレクイエムの大迷宮を制覇";
            var_790 = 2;
        }
        if (var_356 == 313) {
            var_798 = "" + var_21 + "から帰還";
            var_790 = 1;
        }
        if (var_356 == 314) {
            var_798 = "" + var_21 + "を制覇して無事に帰る";
            var_790 = 2;
        }
        if (var_356 == 315) {
            var_798 = "協力して" + var_21 + "を制覇";
            var_790 = 2;
        }
        if (var_356 == 318) {
            var_798 = "協力してエンヤホテルを制覇";
            var_790 = 2;
        }
        if (var_356 == 319) {
            var_798 = "協力してレクイエムの大迷宮を制覇";
            var_790 = 2;
        }
        if (var_356 == 320) {
            var_798 = "協力してディアボロの試練を制覇";
            var_790 = 2;
        }
        if (var_356 == 321) {
            var_798 = "虹村屋敷から生還";
            var_790 = 2;
        }
        if (var_356 == 322) {
            var_798 = "吉良屋敷から生還";
            var_790 = 2;
        }
        if (var_356 == 323) {
            var_798 = "協力して虹村屋敷から生還";
            var_790 = 2;
        }
        if (var_356 == 324) {
            var_798 = "協力して吉良屋敷から生還";
            var_790 = 2;
        }
        if (var_356 == 325) {
            var_798 = "杜王町埠頭から生還";
            var_790 = 2;
        }
        if (var_356 == 326) {
            var_798 = "協力して杜王町埠頭から生還";
            var_790 = 2;
        }
        return;
    });
}