// スタンドの共鳴効果
function func497() {
    return __awaiter(this, void 0, void 0, function* () {
        dbgprt(497);
        if (var_270 == 0) {
            return;
        }
        if (var_1926 == 0) {
            return;
        }
        var_1173 = var_270;
        if (var_1929 != 0) {
            return;
        }
        var_1241 = 1;
        for (var cnt1 = 0; cnt1 < 5; ++cnt1) {
            yield func337();
        }
        var_293 = var_296;
        var_294 = var_297;
        var_296 = "装備したスタンドが引きあっている！";
        var_297 = "";
        var_198 = 1;
        var_300 = 0;
        var_25_x = var_25[1];
        var_26_x = var_26[1];
        var_27_x = var_27[1];
        yield func047();
        yield func050();
        var_1572 = 1;
        var_271 = 1;
        DSPLAY(233);
        for (var cnt1 = 0; cnt1 < 10; ++cnt1) {
            yield func337();
            yield func337();
            var_1572++;
        }
        var_1572 = 0;
        var_271 = 0;
        var_293 = var_296;
        var_294 = var_297;
        var_297 = "";
        if (var_270 == 1) {
            var_296 = "「同じタイプのスタンド！」";
        }
        if (var_270 == 101) {
            var_296 = "「狩り(ハンティング)に行こう！」";
        }
        if (var_270 == 102) {
            var_296 = "「ジョースターの血統」";
        }
        if (var_270 == 103) {
            var_296 = "「愛＝理解」";
        }
        if (var_270 == 104) {
            var_296 = "「オラオラ無駄無駄」";
        }
        if (var_270 == 105) {
            var_296 = "「本当に頼りになるやつだ」";
        }
        if (var_270 == 106) {
            var_296 = "「協力してもらうぜ」";
        }
        if (var_270 == 107) {
            var_296 = "「一緒に登ってきた」";
        }
        if (var_270 == 108) {
            var_296 = "「お前は俺を怒らせた」";
        }
        if (var_270 == 109) {
            var_296 = "「狩り(ハンティング)に行こう！」";
        }
        if (var_270 == 110) {
            var_296 = "「ジョースターの血統」";
        }
        if (var_270 == 111) {
            var_296 = "「愛＝理解」";
        }
        if (var_270 == 112) {
            var_296 = "「オラオラ無駄無駄」";
        }
        if (var_270 == 113) {
            var_296 = "「本当に頼りになるやつだ」";
        }
        if (var_270 == 114) {
            var_296 = "「協力してもらうぜ」";
        }
        if (var_270 == 115) {
            var_296 = "「一緒に登ってきた」";
        }
        if (var_270 == 116) {
            var_296 = "「気が合う二人」";
        }
        if (var_270 == 117) {
            var_296 = "「僕らの街　杜王町」";
        }
        if (var_270 == 118) {
            var_296 = "「直さないからいい！」";
        }
        if (var_270 == 119) {
            var_296 = "「友情のしるし！」";
        }
        if (var_270 == 120) {
            var_296 = "「注文の不思議な料理店！」";
        }
        if (var_270 == 121) {
            var_296 = "「追跡しろ！」";
        }
        if (var_270 == 122) {
            var_296 = "「僕らの街　杜王町」";
        }
        if (var_270 == 123) {
            var_296 = "「ハッピー＆メルヘン」";
        }
        if (var_270 == 124) {
            var_296 = "「うンまぁ～い！」";
        }
        if (var_270 == 125) {
            var_296 = "「チーム・ブチャラティ」";
        }
        if (var_270 == 126) {
            var_296 = "「チーム・ブチャラティ」";
        }
        if (var_270 == 127) {
            var_296 = "「チーム・ブチャラティ」";
        }
        if (var_270 == 128) {
            var_296 = "「夢のために！」";
        }
        if (var_270 == 129) {
            var_296 = "「チーム・ブチャラティ」";
        }
        if (var_270 == 130) {
            var_296 = "「チーム・ブチャラティ」";
        }
        if (var_270 == 131) {
            var_296 = "「チーム・ブチャラティ」";
        }
        if (var_270 == 132) {
            var_296 = "「チーム・ブチャラティ」";
        }
        if (var_270 == 133) {
            var_296 = "「チーム・ブチャラティ」";
        }
        if (var_270 == 134) {
            var_296 = "「こいつにスパゲティを」";
        }
        if (var_270 == 135) {
            var_296 = "「達人二刀流」";
        }
        if (var_270 == 136) {
            var_296 = "「はっはっは　狙え狙え」";
        }
        if (var_270 == 137) {
            var_296 = "「挟み撃ちの形」";
        }
        if (var_270 == 138) {
            var_296 = "「過去を乗り越える！」";
        }
        if (var_270 == 139) {
            var_296 = "「絶頂の能力」";
        }
        if (var_270 == 140) {
            var_296 = "「ＤＩＯの血統」";
        }
        if (var_270 == 141) {
            var_296 = "「信頼できる友」";
        }
        if (var_270 == 142) {
            var_296 = "「血をささげます」";
        }
        if (var_270 == 143) {
            var_296 = "「空気が火を吹いた！」";
        }
        if (var_270 == 144) {
            var_296 = "「第２の爆弾」";
        }
        if (var_270 == 145) {
            var_296 = "「第３の爆弾」";
        }
        if (var_270 == 146) {
            var_296 = "「キラークィーン」";
        }
        if (var_270 == 147) {
            var_296 = "「純潔の日々、戻らず！！」";
        }
        if (var_270 == 148) {
            var_296 = "「ヤバイ「ＤＩＳＣ」がＩＮ！！」";
        }
        if (var_270 == 149) {
            var_296 = "「祝福しろ！」";
        }
        if (var_270 == 150) {
            var_296 = "「無重力の二人」";
        }
        if (var_270 == 151) {
            var_296 = "「愛と復讐のキッス」";
        }
        if (var_270 == 152) {
            var_296 = "「幽霊部屋の仲間」";
        }
        if (var_270 == 153) {
            var_296 = "「一人でリラックス」";
        }
        if (var_270 == 154) {
            var_296 = "「暗殺チーム」";
        }
        if (var_270 == 155) {
            var_296 = "「暗殺チーム」";
        }
        if (var_270 == 156) {
            var_296 = "「暗殺チーム」";
        }
        if (var_270 == 157) {
            var_296 = "「真の邪悪」";
        }
        if (var_270 == 158) {
            var_296 = "「パンティーあげちゃうッ！」";
        }
        if (var_270 == 159) {
            var_296 = "「整形手術」";
        }
        if (var_270 == 160) {
            var_296 = "「水中へよ～こそ」";
        }
        if (var_270 == 161) {
            var_296 = "「雷で最大発電！」";
        }
        if (var_270 == 162) {
            var_296 = "「雷で最大発電！」";
        }
        if (var_270 == 163) {
            var_296 = "「電気イスの刑」";
        }
        if (var_270 == 164) {
            var_296 = "「邪悪の化身」";
        }
        if (var_270 == 165) {
            var_296 = "「邪悪の化身」";
        }
        if (var_270 == 166) {
            var_296 = "「暗黒空間の軌跡」";
        }
        if (var_270 == 167) {
            var_296 = "「気まずい二人」";
        }
        if (var_270 == 168) {
            var_296 = "「気まずい二人」";
        }
        if (var_270 == 169) {
            var_296 = "「マジに信じたのか！」";
        }
        var_198 = 1;
        var_300 = 0;
        var_25_x = var_25[1];
        var_26_x = var_26[1];
        var_27_x = var_27[1];
        yield func047();
        yield func050();
        for (var cnt1 = 0; cnt1 < 10; ++cnt1) {
            yield func337();
        }
        var_1241 = 0;
        return;
    });
}