// 各アイテムリスト
function func492() {
    return __awaiter(this, void 0, void 0, function* () {
        dbgprt(492);
        var_489 = "";
        var_806 = "";
        var_808 = "";
        var_828 = "";
        var_1946 = "";
        var_1947 = "";
        var_2173 = "";
        var_483 = 0;
        var_1984 = 0;
        var_812 = 0;
        var_2174 = 0;
        var_2039 = "";
        var_2175 = "";
        if (var_232 == 1) {
            var_483 = 0;
            var_489 = "お金";
            var_806 = "[お金]";
            var_808 = "";
            var_828 = "";
        }
        if (var_232 == 100) {
            var_483 = 17000;
            var_489 = "ｽﾀｰ･ﾌﾟﾗﾁﾅのDISC";
            var_806 = "攻撃:8　防御:4";
            var_808 = "[発動]射撃攻撃を防げるようになるぞ";
            var_828 = "３方向に攻撃できるぞ";
            var_812 = 1;
            var_1984 = 7;
            var_2173 = "星";
            var_2174 = 1;
            var_2039 = "弾丸止め";
        }
        if (var_232 == 101) {
            var_483 = 14000;
            var_489 = "ｼﾙﾊﾞｰﾁｬﾘｵｯﾂのDISC";
            var_806 = "攻撃:4　防御:1";
            var_808 = "[発動]５ターンの間、残像を出現させるぞ";
            var_828 = "時々２回連続で攻撃できるぞ";
            var_812 = 1;
            var_1984 = 9;
            var_2173 = "銀";
            var_2174 = 1;
            var_2039 = "ブラボー！";
        }
        if (var_232 == 102) {
            var_483 = 19000;
            var_489 = "ｷﾝｸﾞ･ｸﾘﾑｿﾞﾝのDISC";
            var_806 = "攻撃:9　防御:3";
            var_808 = "[発動]５ターンの時間が消し飛ぶぞ";
            var_828 = "裏切り者に大ダメージを与えるぞ";
            var_812 = 1;
            var_1984 = 5;
            var_2173 = "王";
            var_2174 = 1;
            var_2039 = "時よ消し飛べ！";
        }
        if (var_232 == 103) {
            var_483 = 650;
            var_489 = "ｴｺｰｽﾞACT3のDISC";
            var_806 = "攻撃:2　防御:1";
            var_808 = "[発動]目の前の敵を鈍足状態にするぞ";
            var_828 = "時々相手を遅くさせるぞ";
            var_812 = 1;
            var_1984 = 8;
            var_2173 = "鈍";
            var_2174 = 1;
            var_2039 = "ACT 3 FREEZE ！";
        }
        if (var_232 == 104) {
            var_483 = 700;
            var_489 = "ｻﾞ･ﾊﾝﾄﾞのDISC";
            var_806 = "攻撃:7　防御:1";
            var_808 = "[発動]遠くの敵やアイテムを引き寄せるぞ";
            var_828 = "壁や罠をガオンと消せるぞ";
            var_812 = 1;
            var_1984 = 4;
            var_2173 = "手";
            var_2174 = 1;
            var_2039 = "空間を削り取る！";
        }
        if (var_232 == 105) {
            var_483 = 1250;
            var_489 = "ﾁﾘﾍﾟｯﾊﾟｰのDISC";
            var_806 = "攻撃:3　防御:2";
            var_808 = "[発動]部屋内の敵を一定時間盲目にするぞ";
            var_828 = "連続空振りすると次に会心が出るぞ";
            var_812 = 1;
            var_1984 = 4;
            var_2173 = "電";
            var_2174 = 1;
            var_2039 = "電力放出！";
        }
        if (var_232 == 106) {
            var_483 = 4600;
            var_489 = "ｸﾚｲｼﾞｰ･DのDISC";
            var_806 = "攻撃:7　防御:1";
            var_808 = "[発動]このDISCと引き換えにDISCを合成するぞ";
            var_828 = "会心の一撃が多く出るぞ";
            var_812 = 1;
            var_1984 = 4;
            var_2173 = "狂";
            var_2174 = 2;
            var_2039 = "合成";
        }
        if (var_232 == 107) {
            var_483 = 750;
            var_489 = "ﾃﾞｽ･13のDISC";
            var_806 = "攻撃:2　防御:1";
            var_808 = "[発動]隣接した敵を眠らせるぞ";
            var_828 = "寝ている敵を起こしにくいぞ";
            var_812 = 3;
            var_1984 = 3;
            var_2173 = "夢";
            var_2174 = 1;
            var_2039 = "ラリホ～ッ！";
            if (var_172 == 1) {
                var_808 = "[★発動]部屋内の敵を眠らせるぞ";
            }
        }
        if (var_232 == 108) {
            var_483 = 16000;
            var_489 = "ｽﾃｨｯｷｰﾌｨﾝｶﾞｰｽﾞのDISC";
            var_806 = "攻撃:4　防御:3";
            var_808 = "[発動]キーを押すまで敵をやりすごせるぞ";
            var_828 = "２マス先まで攻撃できるぞ";
            var_812 = 1;
            var_1984 = 5;
            var_2173 = "指";
            var_2174 = 1;
            var_2039 = "去るのを待つんだ";
        }
        if (var_232 == 109) {
            var_483 = 13200;
            var_489 = "ﾏｼﾞｼｬﾝｽﾞﾚｯﾄﾞのDISC";
            var_806 = "攻撃:6　防御:2";
            var_808 = "[発動]部屋内の敵にランダムでダメージＳ";
            var_828 = "体力満タンでＣＦＨが撃てるぞ";
            var_812 = 1;
            var_1984 = 3;
            var_2173 = "赤";
            var_2174 = 1;
            var_2039 = "ｸﾛｽﾌｧｲｱｰﾊﾘｹｰﾝ";
            if (var_172 == 1) {
                var_808 = "[★発動]部屋内の敵にランダムでダメージＳ";
            }
        }
        if (var_232 == 111) {
            var_483 = 15600;
            var_489 = "ｻﾞ･ﾜｰﾙﾄﾞのDISC";
            var_806 = "攻撃:9　防御:4";
            var_808 = "[発動]5ﾀｰﾝの間、時間が止まるぞ";
            var_828 = "ジョースターの血統に大ダメージ";
            var_812 = 1;
            var_1984 = 3;
            var_2173 = "世";
            var_2174 = 1;
            var_2039 = "時よ止まれ！";
        }
        if (var_232 == 112) {
            var_483 = 11700;
            var_489 = "ｷﾗｰ･ｸｨｰﾝのDISC";
            var_806 = "攻撃:5　防御:3";
            var_808 = "[発動]目の前にｼｱｰﾊｰﾄｱﾀｯｸを呼び出すぞ";
            var_828 = "杜王町住人に大ダメージを与えるぞ";
            var_812 = 1;
            var_1984 = 4;
            var_2173 = "殺";
            var_2174 = 1;
            var_2039 = "シアーハートアタック！";
        }
        if (var_232 == 113) {
            var_483 = 6100;
            var_489 = "ｸﾗｯｼｭのDISC";
            var_806 = "攻撃:4　防御:0";
            var_808 = "[発動]目の前の敵を瞬間移動させるぞ";
            var_828 = "水場を通して攻撃できるぞ";
            var_812 = 1;
            var_1984 = 5;
            var_2173 = "鮫";
            var_2174 = 0;
            var_2039 = "くらいつけ！";
        }
        if (var_232 == 114) {
            var_483 = 9400;
            var_489 = "ﾎﾜｲﾄｽﾈｲｸのDISC";
            var_806 = "攻撃:3　防御:1";
            var_808 = "[発動]目の前の敵を倒しDISCにするぞ";
            var_828 = "囚人に大ダメージを与えるぞ";
            var_812 = 1;
            var_1984 = 6;
            var_2173 = "蛇";
            var_2174 = 1;
            var_2039 = "ＤＩＳＣ化";
        }
        if (var_232 == 115) {
            var_483 = 5200;
            var_489 = "G･ｴｸｽﾍﾟﾘｴﾝｽのDISC";
            var_806 = "攻撃:4　防御:2";
            var_808 = "[発動]攻撃を跳ね返す植物が出現するぞ";
            var_828 = "ｶｴﾙを持ってるとﾀﾞﾒｰｼﾞを反射するぞ";
            var_812 = 2;
            var_1984 = 5;
            var_2173 = "金";
            var_2174 = 1;
            var_2039 = "植物生成";
        }
        if (var_232 == 116) {
            var_483 = 700;
            var_489 = "ﾊｰﾐｯﾄﾊﾟｰﾌﾟﾙのDISC";
            var_806 = "攻撃:1　防御:2";
            var_808 = "[発動]このフロアの地図がわかるぞ";
            var_828 = "波紋に弱い敵に大ﾀﾞﾒｰｼﾞを与えるぞ";
            var_812 = 1;
            var_1984 = 10;
            var_2173 = "紫";
            var_2174 = 1;
            var_2039 = "周辺感知";
        }
        if (var_232 == 117) {
            var_483 = 3800;
            var_489 = "ﾀﾞｰｸﾌﾞﾙｰﾑｰﾝのDISC";
            var_806 = "攻撃:2　防御:2";
            var_808 = "[発動]部屋内の敵から体力を吸い取るぞ";
            var_828 = "周囲に水があるほど強いぞ";
            var_812 = 1;
            var_1984 = 3;
            var_2173 = "青";
            var_2174 = 0;
            var_2039 = "フジツボ";
            if (var_172 == 1) {
                var_808 = "[★発動]部屋内の敵から体力を吸い取るぞ";
            }
        }
        if (var_232 == 118) {
            var_483 = 6300;
            var_489 = "ﾀﾞｲﾊﾞｰﾀﾞｳﾝのDISC";
            var_806 = "攻撃:2　防御:3";
            var_808 = "[発動]周囲にﾀﾞｲﾊﾞｰﾀﾞｳﾝを潜ませておけるぞ";
            var_828 = "近くの敵に壁を通して攻撃できるぞ";
            var_812 = 1;
            var_1984 = 6;
            var_2173 = "潜";
            var_2174 = 0;
            var_2039 = "潜水して待ち伏せ";
        }
        if (var_232 == 119) {
            var_483 = 2850;
            var_489 = "ｽﾊﾟｲｽ･ｶﾞｰﾙのDISC";
            var_806 = "攻撃:2　防御:3";
            var_808 = "[発動]直接攻撃を喰らうと後ろに弾むぞ";
            var_828 = "ｱｲﾃﾑを壊されることがなくなるぞ";
            var_812 = 2;
            var_1984 = 5;
            var_2173 = "柔";
            var_2174 = 0;
            var_2039 = "柔ラカクスル！";
        }
        if (var_232 == 120) {
            var_483 = 2700;
            var_489 = "ｽﾄｰﾝ･ﾌﾘｰのDISC";
            var_806 = "攻撃:3　防御:4";
            var_808 = "[発動]体力が全回復するぞ";
            var_828 = "後ろの敵に連続して攻撃できるぞ";
            var_812 = 1;
            var_1984 = 6;
            var_2173 = "糸";
            var_2174 = 1;
            var_2039 = "縫合";
        }
        if (var_232 == 121) {
            var_483 = 1000;
            var_489 = "ﾊﾟｰﾌﾟﾙ･ﾍｲｽﾞのDISC";
            var_806 = "攻撃:7　防御:1";
            var_808 = "[発動]ウイルスで部屋内全員にダメージＡ";
            var_828 = "時々変な方向を攻撃してしまうぞ";
            var_812 = 1;
            var_1984 = 5;
            var_2173 = "毒";
            var_2174 = 1;
            var_2039 = "殺人ウイルス";
            if (var_172 == 1) {
                var_808 = "[★発動]ウイルスで部屋内全員にダメージＡ";
            }
        }
        if (var_232 == 122) {
            var_483 = 1000;
            var_489 = "ｱﾇﾋﾞｽ神のDISC";
            var_806 = "攻撃:6　防御:0";
            var_808 = "[発動]同種に連続で直接攻撃する程大ﾀﾞﾒｰｼﾞ";
            var_828 = "アイテムが壁をすり抜けて飛ぶぞ";
            var_812 = 3;
            var_1984 = 3;
            var_2173 = "刀";
            var_2174 = 0;
            var_2039 = "憶えるぞ！";
        }
        if (var_232 == 123) {
            var_483 = 11000;
            var_489 = "ｸﾘｰﾑのDISC";
            var_806 = "攻撃:8　防御:0";
            var_808 = "[発動]前方の敵を亜空間に飲み込むぞ";
            var_828 = "稀に相手を一撃で倒せるぞ";
            var_812 = 1;
            var_1984 = 3;
            var_2173 = "亜";
            var_2174 = 1;
            var_2039 = "亜空の瘴気";
        }
        if (var_232 == 124) {
            var_483 = 600;
            var_489 = "ﾑｰﾃﾞｨｰﾌﾞﾙｰｽのDISC";
            var_806 = "攻撃:1　防御:1";
            var_808 = "[発動]アイテムを一つ倉庫に送れるぞ";
            var_828 = "新入りに大ダメージを与えるぞ";
            var_812 = 1;
            var_1984 = 5;
            var_2173 = "返";
            var_2174 = 1;
            var_2039 = "ギュルギュル";
        }
        if (var_232 == 200) {
            var_483 = 1800;
            var_489 = "ｽｰﾊﾟｰﾌﾗｲのDISC";
            var_806 = "攻撃:0　防御:5";
            var_808 = "[発動]20ﾀｰﾝの間 鉄塔を出現させるぞ";
            var_828 = "痛恨の一撃のダメージを返すぞ";
            var_812 = 2;
            var_1984 = 4;
            var_2173 = "塔";
            var_2174 = 0;
            var_2039 = "鉄塔生成";
        }
        if (var_232 == 201) {
            var_483 = 1500;
            var_489 = "ｲｴﾛｰﾃﾝﾊﾟﾗﾝｽのDISC";
            var_806 = "攻撃:1　防御:4";
            var_808 = "[発動]このﾌﾛｱで熱と冷気に強くなるぞ";
            var_828 = "肉片攻撃が効かなくなるぞ";
            var_812 = 2;
            var_1984 = 3;
            var_2173 = "黄";
            var_2174 = 1;
            var_2039 = "火も氷も無駄！";
        }
        if (var_232 == 202) {
            var_483 = 6100;
            var_489 = "ﾎﾜｲﾄｱﾙﾊﾞﾑのDISC";
            var_806 = "攻撃:0　防御:8";
            var_808 = "[発動]部屋内の敵を凍らせるぞ";
            var_828 = "時々敵を氷漬けにするぞ";
            var_812 = 1;
            var_1984 = 5;
            var_2173 = "氷";
            var_2174 = 0;
            var_2039 = "超低温の世界";
            if (var_172 == 1) {
                var_808 = "[★発動]フロア内全ての敵を凍らせるぞ";
            }
        }
        if (var_232 == 203) {
            var_483 = 4400;
            var_489 = "ｻﾞ･ﾌｰﾙのDISC";
            var_806 = "攻撃:1　防御:4";
            var_808 = "[発動]周囲に砂をかけて他の場所へ飛ぶぞ";
            var_828 = "砂に変化して攻撃をかわせるぞ";
            var_812 = 2;
            var_1984 = 3;
            var_2173 = "砂";
            var_2174 = 0;
            var_2039 = "砂のザ･フール";
        }
        if (var_232 == 204) {
            var_483 = 5300;
            var_489 = "ｼｱｰﾊｰﾄｱﾀｯｸのDISC";
            var_806 = "攻撃:1　防御:8";
            var_808 = "[発動]この場で爆発を起こすぞ";
            var_828 = "最大HPが増えるぞ";
            var_812 = 4;
            var_1984 = 4;
            var_2173 = "爆";
            var_2174 = 1;
            var_2039 = "周辺爆破";
        }
        if (var_232 == 205) {
            var_483 = 3500;
            var_489 = "ｸﾗﾌﾄﾜｰｸのDISC";
            var_806 = "攻撃:1　防御:5";
            var_808 = "[発動]隣接した敵をその場に固定するぞ";
            var_828 = "射撃によるダメージを抑えるぞ";
            var_812 = 2;
            var_1984 = 5;
            var_2173 = "停";
            var_2174 = 1;
            var_2039 = "「固定」";
            if (var_172 == 1) {
                var_808 = "[★発動]部屋内の敵をその場に固定するぞ";
            }
        }
        if (var_232 == 206) {
            var_483 = 4200;
            var_489 = "ｵｱｼｽのDISC";
            var_806 = "攻撃:0　防御:3";
            var_808 = "[発動]20ﾀｰﾝの間、周囲の壁を溶かすぞ";
            var_828 = "殴る時に時々敵を柔らかくするぞ";
            var_812 = 2;
            var_1984 = 5;
            var_2173 = "泥";
            var_2174 = 1;
            var_2039 = "泥化";
        }
        if (var_232 == 207) {
            var_483 = 2500;
            var_489 = "ｸﾞﾚｲﾄﾌﾙ･ﾃﾞｯﾄﾞのDISC";
            var_806 = "攻撃:2　防御:2";
            var_808 = "[発動]部屋内の敵の攻撃力を下げるぞ";
            var_828 = "若化攻撃・老化攻撃を防ぐぞ";
            var_812 = 3;
            var_1984 = 5;
            var_2173 = "老";
            var_2174 = 0;
            var_2039 = "老化攻撃";
            if (var_172 == 1) {
                var_808 = "[★発動]フロア内全ての敵の攻撃力を下げるぞ";
            }
        }
        if (var_232 == 300) {
            var_483 = 2000;
            var_489 = "ﾊﾟｰﾙ･ｼﾞｬﾑのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]満腹度が50回復するぞ";
            var_828 = "お腹が減りにくいぞ";
            var_812 = 3;
            var_1984 = 4;
            var_2173 = "食";
            var_2174 = 1;
            var_2039 = "食べる";
        }
        if (var_232 == 301) {
            var_483 = 8800;
            var_489 = "ﾊｰｳﾞｪｽﾄのDISC";
            var_806 = "攻撃:1　防御:2";
            var_808 = "[発動]アイテムを最大9個集めてくるぞ";
            var_828 = "アイテムのある場所を感知できるぞ";
            var_812 = 3;
            var_1984 = 4;
            var_2173 = "拾";
            var_2174 = 1;
            var_2039 = "アイテム収集";
        }
        if (var_232 == 302) {
            var_483 = 800;
            var_489 = "ﾊｲｳｪｲ･ﾄｩ･ﾍﾙのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]道連れで部屋全体にダメージＣ";
            var_828 = "死にたくなってくるぞ";
            var_812 = 3;
            var_1984 = 6;
            var_2173 = "道";
            var_2174 = 0;
            var_2039 = "一緒にいこうよォ～";
            if (var_172 == 1) {
                var_808 = "[★発動]道連れで部屋全体にダメージＣ";
            }
        }
        if (var_232 == 303) {
            var_483 = 7400;
            var_489 = "ﾄﾞﾗｺﾞﾝｽﾞﾄﾞﾘｰﾑのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]攻撃をかわしやすくなるぞ";
            var_828 = "罠を感知できるぞ";
            var_812 = 3;
            var_1984 = 6;
            var_2173 = "龍";
            var_2174 = 0;
            var_2039 = "安全な方角";
        }
        if (var_232 == 304) {
            var_483 = 3900;
            var_489 = "ｳｪｻﾞｰﾘﾎﾟｰﾄのDISC";
            var_806 = "攻撃:3　防御:6";
            var_808 = "[発動]落雷で部屋内全員にダメージＢ";
            var_828 = "弾丸が届きにくくなるぞ";
            var_812 = 2;
            var_1984 = 6;
            var_2173 = "天";
            var_2174 = 0;
            var_2039 = "落雷";
            if (var_172 == 1) {
                var_808 = "[★発動]落雷で部屋内全員にダメージＢ";
            }
        }
        if (var_232 == 305) {
            var_483 = 7900;
            var_489 = "ｼﾝﾃﾞﾚﾗのDISC";
            var_806 = "攻撃:1　防御:1";
            var_808 = "[発動]次の階でｱｲﾃﾑがたくさん出るぞ";
            var_828 = "敵がｱｲﾃﾑを落としやすくなるぞ";
            var_812 = 3;
            var_1984 = 4;
            var_2173 = "幸";
            var_2174 = 0;
            var_2039 = "運が良くなるメイク";
        }
        if (var_232 == 306) {
            var_483 = 2500;
            var_489 = "ﾏﾝﾊｯﾀﾝﾄﾗﾝｽﾌｧｰのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]敵のいる位置がわかるようになるぞ";
            var_828 = "射撃ｽﾀﾝﾄﾞの攻撃力が修正値分上昇";
            var_812 = 4;
            var_1984 = 6;
            var_2173 = "衛";
            var_2174 = 0;
            var_2039 = "空気の流れを読む！";
        }
        if (var_232 == 308) {
            var_483 = 2200;
            var_489 = "ｴﾎﾞﾆｰ･ﾃﾞﾋﾞﾙのDISC";
            var_806 = "攻撃:2　防御:0";
            var_808 = "[発動]目の前にエボニー人形を呼び出すぞ";
            var_828 = "恨みのある敵へのﾀﾞﾒｰｼﾞが倍増\t\t";
            var_812 = 3;
            var_1984 = 3;
            var_2173 = "悪";
            var_2174 = 1;
            var_2039 = "恨みはらさで…";
        }
        if (var_232 == 310) {
            var_483 = 1000;
            var_489 = "ｴﾝﾌﾟﾚｽのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]大声で敵を呼び寄せてしまうぞ";
            var_828 = "時々全ての敵を目覚めさせるぞ";
            var_812 = 3;
            var_1984 = 3;
            var_2173 = "疽";
            var_2174 = 0;
            var_2039 = "ここにいるわよッ！";
        }
        if (var_232 == 311) {
            var_483 = 1000;
            var_489 = "ﾁｰﾌﾟ･ﾄﾘｯｸのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]ブツブツ言われて精神力が弱るぞ";
            var_828 = "背中を見られるとﾀﾞﾒｰｼﾞを喰らうぞ";
            var_812 = 3;
            var_1984 = 4;
            var_2173 = "背";
            var_2174 = 1;
            var_2039 = "おはなし";
        }
        if (var_232 == 312) {
            var_483 = 8200;
            var_489 = "ｴｱﾛｽﾐｽのDISC";
            var_806 = "攻撃:2　防御:0";
            var_808 = "[発動]フロア中にランダムでダメージＳ";
            var_828 = "敵の場所を感知できるぞ";
            var_812 = 3;
            var_1984 = 5;
            var_2173 = "飛";
            var_2174 = 1;
            var_2039 = "無差別乱射";
            if (var_172 == 1) {
                var_808 = "[★発動]フロア中にランダムでダメージＳ";
            }
        }
        if (var_232 == 313) {
            var_483 = 5200;
            var_489 = "ﾊｲｳｪｲ･ｽﾀｰのDISC";
            var_806 = "攻撃:1　防御:1";
            var_808 = "[発動]部屋内の敵から満腹度を吸い取るぞ";
            var_828 = "時々ﾀﾞﾒｰｼﾞを吸収しHPを回復するぞ";
            var_812 = 1;
            var_1984 = 4;
            var_2173 = "養";
            var_2174 = 0;
            var_2039 = "養分をくれェ～";
            if (var_172 == 1) {
                var_808 = "[★発動]部屋内の敵から養分を吸い取るぞ";
            }
        }
        if (var_232 == 314) {
            var_483 = 1900;
            var_489 = "ｽﾄﾚｲ･ｷｬｯﾄのDISC";
            var_806 = "攻撃:0　防御:6";
            var_808 = "[発動]空気弾を発射して動きを止めるぞ";
            var_828 = "爆風によるﾀﾞﾒｰｼﾞが少なくなるぞ";
            var_812 = 3;
            var_1984 = 4;
            var_2173 = "猫";
            var_2174 = 0;
            var_2039 = "空気弾";
        }
        if (var_232 == 315) {
            var_483 = 3500;
            var_489 = "ｴﾋﾟﾀﾌのDISC";
            var_806 = "攻撃:2　防御:1";
            var_808 = "[発動]敵･罠の可視･感知。透明でも見えるぞ";
            var_828 = "周囲に罠があると警告が出るぞ";
            var_812 = 4;
            var_1984 = 5;
            var_2173 = "予";
            var_2174 = 0;
            var_2039 = "エピタフ！";
        }
        if (var_232 == 316) {
            var_483 = 1000;
            var_489 = "ｻﾊﾞｲﾊﾞｰのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]部屋内の敵が混乱するぞ";
            var_828 = "方向転換キーで敵の体力がわかるぞ";
            var_812 = 3;
            var_1984 = 6;
            var_2173 = "乱";
            var_2174 = 1;
            var_2039 = "ファイトクラブ";
            if (var_172 == 1) {
                var_808 = "[★発動]フロア内全ての敵が混乱するぞ";
            }
        }
        if (var_232 == 317) {
            var_483 = 2300;
            var_489 = "ｷｯｽのDISC";
            var_806 = "攻撃:4　防御:1";
            var_808 = "[発動]ｷｯｽのｼｰﾙを地面に貼り付けるぞ";
            var_828 = "殴った敵が時々分裂するぞ";
            var_812 = 1;
            var_1984 = 6;
            var_2173 = "分";
            var_2174 = 1;
            var_2039 = "シール";
        }
        if (var_232 == 318) {
            var_483 = 1800;
            var_489 = "ｼﾞｬﾝﾋﾟﾝJﾌﾗｯｼｭのDISC";
            var_806 = "攻撃:2　防御:3";
            var_808 = "[発動]真空で部屋内全員にダメージＢ";
            var_828 = "時々敵をふっとばして混乱させるぞ";
            var_812 = 1;
            var_1984 = 6;
            var_2173 = "空";
            var_2174 = 0;
            var_2039 = "真空の部屋";
            if (var_172 == 1) {
                var_808 = "[★発動]真空で部屋内全員にダメージＢ";
            }
        }
        if (var_232 == 319) {
            var_483 = 3400;
            var_489 = "ﾎﾞｰｲIIﾏﾝのDISC";
            var_806 = "攻撃:2　防御:2";
            var_808 = "[発動]合成された能力を消去できるぞ";
            var_828 = "殴った敵が時々封印状態になるぞ";
            var_812 = 1;
            var_1984 = 4;
            var_2173 = "吸";
            var_2174 = 1;
            var_2039 = "引きずり出す！";
        }
        if (var_232 == 320) {
            var_483 = 4200;
            var_489 = "ﾒﾀﾘｶのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]10ﾀｰﾝ透明になり敵に気づかれないぞ";
            var_828 = "敵や罠からの磁力が効かないぞ";
            var_812 = 3;
            var_1984 = 5;
            var_2173 = "磁";
            var_2174 = 1;
            var_2039 = "透明化";
        }
        if (var_232 == 350) {
            var_483 = 1000;
            var_489 = "☆目覚め";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "寝ている敵を起こしやすいぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 351) {
            var_483 = 1000;
            var_489 = "★睡眠よけ";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "眠らされることが無くなるぞ";
            var_812 = 4;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 352) {
            var_483 = 1000;
            var_489 = "★腹減り防止";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "満腹度の吸い取り攻撃を防ぐぞ";
            var_812 = 4;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 353) {
            var_483 = 1000;
            var_489 = "☆呪われ増加";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "呪われたDISCが出やすいぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 354) {
            var_483 = 1000;
            var_489 = "☆＋修正減り";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "＋のついた装備DISCが出にくいぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 355) {
            var_483 = 1000;
            var_489 = "☆罠発動";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "罠が作動しやすいぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 356) {
            var_483 = 1000;
            var_489 = "☆お金減り";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "拾えるお金の金額が少なくなるぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 357) {
            var_483 = 1000;
            var_489 = "☆睡眠出現減";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "寝ている敵が少なくなるぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 358) {
            var_483 = 1000;
            var_489 = "☆敵増え速い";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "フロアに敵が出現しやすくなるぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 359) {
            var_483 = 1000;
            var_489 = "☆強敵出現";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "時々レベル２の敵が出現するぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 360) {
            var_483 = 1000;
            var_489 = "★カエル変化防止";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "ｱｲﾃﾑをｶｴﾙにされないぞ";
            var_812 = 4;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 361) {
            var_483 = 1000;
            var_489 = "★抜き取り防止";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "神父にDISCを抜き取られないぞ";
            var_812 = 4;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 362) {
            var_483 = 1000;
            var_489 = "★盗まれ防止";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "ﾊｰｳﾞｪｽﾄに盗まれないぞ";
            var_812 = 4;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 363) {
            var_483 = 1000;
            var_489 = "☆磁力倍増";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "磁力が上がりやすいぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 364) {
            var_483 = 1000;
            var_489 = "☆モンハウ増";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "ﾓﾝｽﾀｰﾊｳｽが出やすいぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 365) {
            var_483 = 1000;
            var_489 = "★階段感知";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "階段の場所がわかるぞ";
            var_812 = 4;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 366) {
            var_483 = 1000;
            var_489 = "★ヒラリ防止";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "ヒラリとかわされないぞ";
            var_812 = 1;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 367) {
            var_483 = 1000;
            var_489 = "☆誰からも痛恨";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "誰からも痛恨の一撃を喰らうぞ";
            var_812 = 3;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 368) {
            var_483 = 1000;
            var_489 = "★化け感知";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "敵が化けてるアイテムがわかるぞ";
            var_812 = 4;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 369) {
            var_483 = 1000;
            var_489 = "★暗殺倍打";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "暗殺チームに大ダメージ";
            var_812 = 1;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 370) {
            var_483 = 1000;
            var_489 = "★九柱神倍打";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]なし";
            var_828 = "ｴｼﾞﾌﾟﾄ九柱神に大ダメージ";
            var_812 = 1;
            var_1984 = 0;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "なし";
        }
        if (var_232 == 393) {
            var_483 = 10000;
            var_489 = "ﾎﾞﾍﾐｱﾝﾗﾌﾟｿﾃﾞｨのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]漫画のｷｬﾗｸﾀｰを敵として召還するぞ";
            var_828 = "ｺﾐｯｸｽが出現しやすくなるぞ";
            var_812 = 4;
            var_1984 = 6;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "ボヘミアンラプソディ！";
        }
        if (var_232 == 394) {
            var_483 = 1000;
            var_489 = "ｷﾗｰﾀｲｶﾞｰｸｲｰﾝのDISC";
            var_806 = "攻撃:9　防御:9";
            var_808 = "[発動]ｼｱｰﾊｰﾄｱﾀｯｸを呼び出すぞ";
            var_828 = "杜王町住人に大ダメージを与えるぞ";
            var_812 = 1;
            var_1984 = 4;
            var_2173 = "";
            var_2174 = 1;
            var_2039 = "シアーハートアタック！";
        }
        if (var_232 == 395) {
            var_483 = 4700;
            var_489 = "ﾊﾞｲﾂｧ･ﾀﾞｽﾄのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]部屋の敵を爆弾にし3ﾀｰﾝ後爆発させる";
            var_828 = "能力DISCと引き換えに復活するぞ";
            var_812 = 4;
            var_1984 = 4;
            var_2173 = "戻";
            var_2174 = 1;
            var_2039 = "負けて死ね";
        }
        if (var_232 == 396) {
            var_483 = 10000;
            var_489 = "ﾒｲﾄﾞ･ｲﾝ･ﾍﾌﾞﾝのDISC";
            var_806 = "攻撃:0　防御:0";
            var_808 = "[発動]一時的に速く動けるぞ";
            var_828 = "装備すると速く動けるぞ";
            var_812 = 3;
            var_1984 = 6;
            var_2173 = "速";
            var_2174 = 1;
            var_2039 = "天国の時";
        }
        if (var_232 == 397) {
            var_483 = 10000;
            var_489 = "ﾍﾋﾞｰ･ｳｪｻﾞｰのDISC";
            var_806 = "攻撃:8　防御:8";
            var_808 = "[発動]敵が鈍足になる虹を大量に作り出すぞ";
            var_828 = "弾丸がかなり届きにくくなるぞ";
            var_812 = 3;
            var_1984 = 6;
            var_2173 = "虹";
            var_2174 = 0;
            var_2039 = "ヘビーウェザー";
        }
        if (var_232 == 398) {
            var_483 = 20000;
            var_489 = "ｽﾀﾌﾟﾗｻﾞﾜｰﾙﾄﾞのDISC";
            var_806 = "攻撃:10 防御:10";
            var_808 = "[発動]5ﾀｰﾝの間、時間が止まるぞ";
            var_828 = "３方向に攻撃できるぞ";
            var_812 = 1;
            var_1984 = 7;
            var_2173 = "時";
            var_2174 = 0;
            var_2039 = "ｽﾀｰﾌﾟﾗﾁﾅ･ｻﾞ･ﾜｰﾙﾄﾞ！";
        }
        if (var_232 == 399) {
            var_483 = 1000;
            var_489 = "G･E･ﾚｸｲｴﾑのDISC";
            var_806 = "攻撃:12 防御:12";
            var_808 = "[発動]終わりが無いのが終わりを終わりにする";
            var_828 = "全ての敵に大ダメージを与えるぞ";
            var_812 = 3;
            var_1984 = 5;
            var_2173 = "鎮";
            var_2174 = 0;
            var_2039 = "終わりにする";
        }
        if (var_487 > 0 && var_232 >= 100 && var_232 < 400) {
            var_489 = "☆" + var_489;
        }
        if (var_232 == 400) {
            var_483 = 900;
            var_489 = "ﾊｲｴﾛﾌｧﾝﾄｸﾞﾘｰﾝのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:10";
            var_808 = "離れた敵にダメージを与えるぞ";
            var_828 = "[発動]足元に法王の結界を仕掛けるぞ";
            var_1984 = 3;
            var_2174 = 0;
            var_2039 = "法王の結界";
        }
        if (var_232 == 401) {
            var_483 = 500;
            var_489 = "ﾌｰ･ﾌｧｲﾀｰｽﾞのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:2";
            var_808 = "離れた敵にダメージを与えるぞ";
            var_828 = "[発動]体力を２０回復させるぞ";
            var_1984 = 6;
            var_2174 = 0;
            var_2039 = "プランクトン詰め";
        }
        if (var_232 == 402) {
            var_483 = 800;
            var_489 = "ｴﾝﾍﾟﾗｰのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:8";
            var_808 = "壁に当たると方向が変わるぞ";
            var_828 = "[発動]弾丸の軌道を操れるぞ";
            var_1984 = 3;
            var_2174 = 0;
            var_2039 = "弾丸を操る";
        }
        if (var_232 == 403) {
            var_483 = 700;
            var_489 = "ｾｯｸｽﾋﾟｽﾄﾙｽﾞのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:6";
            var_808 = "同じ部屋の誰かに命中するぞ";
            var_828 = "[発動]ﾋﾟｯﾂｧを食べると射撃回数が増えるぞ";
            var_1984 = 5;
            var_2174 = 0;
            var_2039 = "昼メシの時間";
        }
        if (var_232 == 404) {
            var_483 = 1100;
            var_489 = "ﾎﾙｽ神のDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:0（ﾀﾞﾒｰｼﾞ無）";
            var_808 = "敵を凍らせて動けなくするぞ";
            var_828 = "[発動]足元に氷の罠を仕掛けるぞ";
            var_1984 = 3;
            var_2174 = 0;
            var_2039 = "ホルス神の罠";
        }
        if (var_232 == 405) {
            var_483 = 450;
            var_489 = "ｴｺｰｽﾞACT2のDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:0（ﾀﾞﾒｰｼﾞ無）";
            var_808 = "敵をドヒュウと吹き飛ばせるぞ";
            var_828 = "[発動]足元にドッグォンの文字を仕掛けるぞ";
            var_1984 = 4;
            var_2174 = 0;
            var_2039 = "ドッグォンの文字";
        }
        if (var_232 == 406) {
            var_483 = 550;
            var_489 = "ｴｺｰｽﾞACT1のDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:0（ﾀﾞﾒｰｼﾞ無）";
            var_808 = "音を貼り付けて敵を混乱させるぞ";
            var_828 = "[発動]足元に音の罠を仕掛けるぞ";
            var_1984 = 8;
            var_2174 = 0;
            var_2039 = "ビシ！バギ！ボ！";
        }
        if (var_232 == 407) {
            var_483 = 900;
            var_489 = "ﾊｲｴﾛﾌｧﾝﾄｴﾒﾗﾙﾄﾞのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:15";
            var_808 = "離れた敵にダメージを与えるぞ";
            var_828 = "[発動]足元に法王の結界を仕掛けるぞ";
            var_1984 = 3;
            var_2174 = 0;
            var_2039 = "法王の結界";
        }
        if (var_232 == 408) {
            var_483 = 750;
            var_489 = "ﾏﾝ･ｲﾝ･ｻﾞ･ﾐﾗｰのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:0（ﾀﾞﾒｰｼﾞ無）";
            var_808 = "敵と自分の場所が入れ替わるぞ";
            var_828 = "[発動]鈍足になる鏡を仕掛けるぞ";
            var_1984 = 5;
            var_2174 = 0;
            var_2039 = "半分だけ許可する！";
        }
        if (var_232 == 409) {
            var_483 = 550;
            var_489 = "ﾗﾊﾞｰｽﾞのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:0（ﾀﾞﾒｰｼﾞ無）";
            var_808 = "取り付いた敵は自分と同じﾀﾞﾒｰｼﾞを喰らうぞ";
            var_828 = "[発動]足元にﾗﾊﾞｰｽﾞを潜ませておけるぞ";
            var_1984 = 3;
            var_2174 = 0;
            var_2039 = "ラバーズ";
        }
        if (var_232 == 411) {
            var_483 = 1300;
            var_489 = "ﾀﾜｰ･ｵﾌﾞ･ｸﾞﾚｰのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:5";
            var_808 = "敵を貫通するぞ";
            var_828 = "[発動]近い距離に瞬間的に移動するぞ";
            var_1984 = 3;
            var_2174 = 0;
            var_2039 = "プン";
        }
        if (var_232 == 412) {
            var_483 = 1600;
            var_489 = "ﾍﾌﾞﾝｽﾞﾄﾞｱｰのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:0（ﾀﾞﾒｰｼﾞ無）";
            var_808 = "特殊攻撃を封印するぞ。重ねがけもできるぞ。";
            var_828 = "[発動]目の前の敵の情報がわかるぞ";
            var_1984 = 4;
            var_2174 = 0;
            var_2039 = "ヘブンズドアー";
        }
        if (var_232 == 414) {
            var_483 = 1200;
            var_489 = "ﾀｽｸのDISC";
            var_806 = "[遠距離ｽﾀﾝﾄﾞ]　攻撃力:12";
            var_808 = "離れた敵にダメージを与えるぞ";
            var_828 = "[発動]足元に移動する穴を仕掛けるぞ";
            var_1984 = 99;
            var_2174 = 0;
            var_2039 = "黄金の回転へ！";
        }
        if (var_232 == 560) {
            var_483 = 400;
            var_489 = "仗助のDISC";
            var_806 = "[記憶DISC]";
            var_808 = "髪型をけなされた気分になるぞ";
            var_828 = "投げると敵が混乱するぞ";
            var_1946 = "プッツ―――――ン！";
        }
        if (var_232 == 562) {
            var_483 = 1500;
            var_489 = "康一のDISC";
            var_806 = "[記憶DISC]";
            var_808 = "康一のように急成長するぞ";
            var_828 = "レベルが１上がるぞ";
            var_1946 = "ﾃﾞｨｱﾎﾞﾛはレベルが上がった！";
        }
        if (var_232 == 563) {
            var_483 = 400;
            var_489 = "ﾝﾄﾞｩｰﾙのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "盲目になるが敵の位置を感知できるぞ";
            var_828 = "投げると一定時間盲目にするぞ";
            var_1946 = "目が見えなくなってしまった！";
        }
        if (var_232 == 564) {
            var_483 = 500;
            var_489 = "噴上裕也のDISC";
            var_806 = "[記憶DISC]";
            var_808 = "匂いに敏感になるぞ";
            var_828 = "このフロアの罠の位置を感知するぞ";
            var_1946 = "この階の罠の位置がわかった！";
        }
        if (var_232 == 565) {
            var_483 = 400;
            var_489 = "ﾌﾟｯﾁ神父のDISC";
            var_806 = "[記憶DISC]";
            var_808 = "装備ｽﾀﾝﾄﾞにかかった呪いが解けるぞ";
            var_828 = "";
            var_1946 = "どのアイテムに使いますか？";
        }
        if (var_232 == 566) {
            var_483 = 500;
            var_489 = "ｹﾝｿﾞｰのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "身のかわしが上がるぞ";
            var_828 = "";
            var_1946 = "攻撃をかわしやすくなった気がする！";
        }
        if (var_232 == 567) {
            var_483 = 400;
            var_489 = "ｱｳﾞﾄﾞｩﾙのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "アイテムを鑑定できるぞ";
            var_828 = "";
            var_1946 = "どのアイテムに使いますか？";
        }
        if (var_232 == 568) {
            var_483 = 500;
            var_489 = "ｼﾞｮﾝｶﾞﾘ･AのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "この階で射撃ダメージがアップし、";
            var_828 = "投げたアイテムが必ず当たるようになるぞ";
            var_1946 = "射撃能力がアップした！";
        }
        if (var_232 == 569) {
            var_483 = 500;
            var_489 = "ﾎﾟﾙﾅﾚﾌのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "この階で攻撃力が上がるぞ";
            var_828 = "";
            var_1946 = "この階での攻撃力があがった！";
        }
        if (var_232 == 570) {
            var_483 = 500;
            var_489 = "ｼﾞｮﾅｻﾝのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "この階で波紋が使えるようになり、";
            var_828 = "吸血鬼に与えるダメージが大きくなるぞ";
            var_1946 = "吸血鬼に与えるダメージが大きくなった！";
            var_1947 = "";
        }
        if (var_232 == 571) {
            var_483 = 500;
            var_489 = "ﾎﾞｲﾝｺﾞのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "次の階の予知ができるぞ";
            var_828 = "";
            var_1946 = "「あ…新しいﾍﾟｰｼﾞが…現れたぞ…」";
        }
        if (var_232 == 572) {
            var_483 = 500;
            var_489 = "承太郎のDISC";
            var_806 = "[記憶DISC]";
            var_808 = "この階で命中率が上がるぞ";
            var_828 = "";
            var_1946 = "この階での命中率が上がった！";
        }
        if (var_232 == 573) {
            var_483 = 400;
            var_489 = "重ちーのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "この階のｱｲﾃﾑの場所がわかるぞ";
            var_828 = "";
            var_1946 = "ｱｲﾃﾑの場所がわかった！";
        }
        if (var_232 == 574) {
            var_483 = 500;
            var_489 = "ｴﾝﾎﾟﾘｵのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "わけがわからず混乱してしまうぞ";
            var_828 = "";
            var_1946 = "「うわあああああああ！」";
        }
        if (var_232 == 575) {
            var_483 = 500;
            var_489 = "ﾏﾆｯｼｭﾎﾞｰｲのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "すやすやと眠ってしまうぞ";
            var_828 = "投げると敵が眠るぞ";
            var_1946 = "急に眠気が襲ってきた…";
        }
        if (var_232 == 576) {
            var_483 = 400;
            var_489 = "破裂するDISC";
            var_806 = "[記憶DISC]";
            var_808 = "「10ターン後に破裂する！」と命令が書かれている";
            var_828 = "";
            var_1946 = "【10ターン後に破裂する！】";
        }
        if (var_232 == 577) {
            var_483 = 900;
            var_489 = "ﾐｷﾀｶのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "サイコロに変身できるぞ";
            var_828 = "変身中は敵に気づかれないぞ";
            var_1946 = "サイコロに変身した。";
        }
        if (var_232 == 578) {
            var_483 = 1500;
            var_489 = "ｻﾝﾄﾞﾏﾝのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "スピードがアップするぞ";
            var_828 = "";
            var_1946 = "体の動きが早くなった！";
        }
        if (var_232 == 579) {
            var_483 = 1500;
            var_489 = "ﾍﾟｯﾄｼｮｯﾌﾟのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "別の場所へ飛んでいくぞ";
            var_828 = "";
            var_1946 = "別の場所へ飛んだ！";
        }
        if (var_232 == 580) {
            var_483 = 1500;
            var_489 = "ﾄﾞｯﾋﾟｵのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "ﾄﾞｯﾋﾟｵと交代するぞ";
            var_828 = "交代中は敵に気づかれないぞ";
            var_1946 = "「まかせたぞ… 私のドッピオ…」";
        }
        if (var_232 == 582) {
            var_483 = 300;
            var_489 = "水が熱湯になるDISC";
            var_806 = "[消耗DISC]";
            var_808 = "水が熱湯になるぞ";
            var_828 = "";
            var_1946 = "しかし何も起こらなかった…";
        }
        if (var_232 == 583) {
            var_483 = 900;
            var_489 = "ﾃﾞｨｱﾎﾞﾛのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "地上に逃げ帰ることができるぞ";
            var_828 = "一時退くのは敗北ではないぞ！";
            var_1946 = "";
        }
        if (var_232 == 584) {
            var_483 = 500;
            var_489 = "ﾇｹｻｸのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "この階で攻撃力が下がってしまうぞ";
            var_828 = "";
            var_1946 = "この階での攻撃力が下がってしまった！";
        }
        if (var_232 == 585) {
            var_483 = 500;
            var_489 = "億泰のDISC";
            var_806 = "[記憶DISC]";
            var_808 = "ｻﾞ･ﾊﾝﾄﾞが使いこなせるようになるぞ";
            var_828 = "この階でお腹が減りやすくなってしまうぞ";
            var_1946 = "お腹が減りやすくなってしまった！";
        }
        if (var_232 == 586) {
            var_483 = 900;
            var_489 = "ペッシのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "レベルが下がってしまうぞ";
            var_828 = "";
            var_1946 = "レベルが下がってしまった！";
        }
        if (var_232 == 587) {
            var_483 = 500;
            var_489 = "吉良吉影のDISC";
            var_806 = "[記憶DISC]";
            var_808 = "ｱｲﾃﾑのどれかひとつが爆弾になるぞ";
            var_828 = "爆弾ｱｲﾃﾑがある時は解除できるぞ";
            var_1946 = "爆弾が解除された。";
        }
        if (var_232 == 588) {
            var_483 = 400;
            var_489 = "J･ｶﾞｲﾙのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "非道なことを叫んで敵を怒らせるぞ";
            var_828 = "フロアにいる敵全ての攻撃力が上がるぞ";
            var_1946 = "全ての敵の攻撃力が上がった！";
        }
        if (var_232 == 589) {
            var_483 = 500;
            var_489 = "ﾌﾟﾛｼｭｰﾄ兄貴のDISC";
            var_806 = "[記憶DISC]";
            var_808 = "この階で発動能力の効果が上がるぞ";
            var_828 = "効果が上がっている発動は★がつくぞ";
            var_1946 = "発動能力の効果が上がった！";
        }
        if (var_232 == 590) {
            var_483 = 400;
            var_489 = "ｷﾞｱｯﾁｮのDISC";
            var_806 = "[記憶DISC]";
            var_808 = "無性に腹が立ってｱｲﾃﾑを壊すぞ";
            var_828 = "";
            var_1946 = "どのアイテムに使いますか？";
        }
        if (var_232 == 600) {
            var_483 = 100;
            var_489 = "ﾋﾟｯﾂｧ";
            var_806 = "[食べ物]";
            var_808 = "ﾌﾞﾁｬﾗﾃｨが食べてたｸｫｰﾀｰｻｲｽﾞのﾋﾟｯﾂｧだ";
            var_828 = "満腹度が50回復するぞ";
            var_1946 = "お腹が少し膨らんだ";
        }
        if (var_232 == 602) {
            var_483 = 400;
            var_489 = "ﾈｱﾎﾟﾘｽのﾋﾟｯﾂｧ";
            var_806 = "[食べ物]";
            var_808 = "ﾈｱﾎﾟﾘｽの美味しいﾋﾟｯﾂｧだ";
            var_828 = "満腹度が100回復するぞ";
            var_1946 = "お腹が膨らんだ";
        }
        if (var_232 == 603) {
            var_483 = 50;
            var_489 = "くさったﾋﾟｯﾂｧ";
            var_806 = "[食べ物]";
            var_808 = "変な臭いがする";
            var_828 = "まずそうだぞ";
            var_1946 = "グェッ！精神力が下がってしまった！";
        }
        if (var_232 == 604) {
            var_483 = 800;
            var_489 = "ﾎﾟﾙﾎﾟのﾋﾟｯﾂｧ";
            var_806 = "[食べ物]";
            var_808 = "壁のような巨大なﾋﾟｯﾂｧだ";
            var_828 = "満腹度が全回復し、最大満腹度が増えるぞ";
            var_1946 = "お腹いっぱいで動きが重い…";
        }
        if (var_232 == 605) {
            var_483 = 50;
            var_489 = "焦げたﾋﾟｯﾂｧ";
            var_806 = "[食べ物]";
            var_808 = "焼きすぎて焦げたﾋﾟｯﾂｧだ";
            var_828 = "満腹度が10回復するぞ";
            var_1946 = "焦げてて食べられる部分が無い…";
        }
        if (var_232 == 630) {
            var_483 = 600;
            var_489 = "娼婦風ｽﾊﾟｹﾞｯﾃｨ";
            var_806 = "[ﾄﾆｵ製料理]";
            var_808 = "満腹度が20回復するぞ";
            var_828 = "虫歯がすごい勢いで飛び出るぞ";
            var_1946 = "虫歯が飛び出した！";
        }
        if (var_232 == 631) {
            var_483 = 600;
            var_489 = "ﾓｯﾂｧﾚﾗﾁｰｽﾞとﾄﾏﾄのｻﾗﾀﾞ";
            var_806 = "[ﾄﾆｵ製料理]";
            var_808 = "満腹度が10回復するぞ";
            var_828 = "精神力が回復するぞ";
            var_1946 = "元通り強くなった気がする。";
        }
        if (var_232 == 632) {
            var_483 = 600;
            var_489 = "ｷﾘﾏﾝｼﾞｬﾛの雪解け水";
            var_806 = "[ﾄﾆｵ製料理]";
            var_808 = "満腹度が10回復するぞ";
            var_828 = "盲目状態が治るぞ。普通見えない物も見えるぞ。";
            var_1946 = "目がすっきりした！";
        }
        if (var_232 == 633) {
            var_483 = 600;
            var_489 = "子羊背肉のﾘﾝｺﾞｿｰｽかけ";
            var_806 = "[ﾄﾆｵ製料理]";
            var_808 = "満腹度が20回復するぞ";
            var_828 = "最大満腹度が上がるぞ";
            var_1946 = "最大満腹度が上がった！";
        }
        if (var_232 == 634) {
            var_483 = 600;
            var_489 = "ﾌﾟﾘﾝ";
            var_806 = "[ﾄﾆｵ製料理]";
            var_808 = "満腹度が10回復するぞ";
            var_828 = "鈍足・混乱や腹ヘリ状態が治るぞ。";
            var_1946 = "思うように動けるようになった。";
        }
        if (var_232 == 635) {
            var_483 = 100;
            var_489 = "焦げた料理";
            var_806 = "[食べ物]";
            var_808 = "満腹度が10回復するぞ";
            var_828 = "";
            var_1946 = "焦げてて食べられる部分が無い…";
        }
        if (var_232 == 636) {
            var_483 = 300;
            var_489 = "ｻﾝﾄﾞｲｯﾁ";
            var_806 = "[食べ物]";
            var_808 = "平穏な気持ちになって精神力が１上がるぞ";
            var_828 = "お腹も満腹になるぞ";
            var_1946 = "精神力が１上がった！";
        }
        if (var_232 == 639) {
            var_483 = 100;
            var_489 = "ｶｴﾙの丸焼き";
            var_806 = "[食べ物]";
            var_808 = "「ﾃｲｴﾝﾁｰ」と呼ばれる料理だ。";
            var_828 = "満腹度が20回復するぞ";
            var_1946 = "お腹が少し膨らんだ";
        }
        if (var_232 == 640) {
            var_483 = 50;
            var_489 = "焦げた食べ物";
            var_806 = "[食べ物]";
            var_808 = "焦げた食べ物だ。";
            var_828 = "満腹度が10回復するぞ";
            var_1946 = "焦げてて食べられる部分が無い…";
        }
        if (var_232 == 641) {
            var_483 = 10;
            var_489 = "消し炭";
            var_806 = "[食べ物？]";
            var_808 = "真っ黒に焦げた何かだ。";
            var_828 = "食べると最大満腹度が下がってしまうぞ。";
            var_1946 = "お腹が痛い…";
        }
        if (var_232 == 644) {
            var_483 = 400;
            var_489 = "猫バーガー";
            var_806 = "[食べ物]";
            var_808 = "猫バーガーだ";
            var_828 = "まずそうだぞ";
            var_1946 = "グェッ！";
        }
        if (var_232 == 645) {
            var_483 = 400;
            var_489 = "猫ステーキ";
            var_806 = "[食べ物]";
            var_808 = "猫ステーキだ";
            var_828 = "まずそうだぞ";
            var_1946 = "グェッ！";
        }
        if (var_232 == 646) {
            var_483 = 400;
            var_489 = "猫ジュース";
            var_806 = "[食べ物]";
            var_808 = "猫ジュースだ";
            var_828 = "まずそうだぞ";
            var_1946 = "グェッ！";
        }
        if (var_232 == 647) {
            var_483 = 400;
            var_489 = "オレンジ";
            var_806 = "[食べ物]";
            var_808 = "美味しそうなオレンジだ";
            var_828 = "";
            var_1946 = "お腹が少し膨らんだ";
        }
        if (var_232 == 648) {
            var_483 = 200;
            var_489 = "鎌倉カスター";
            var_806 = "[食べ物]";
            var_808 = "食べかけだ。";
            var_828 = "満腹度が7回復するぞ";
            var_1946 = "お腹が少し膨らんだ";
        }
        if (var_232 == 650) {
            var_483 = 200;
            var_489 = "ｶｴﾙ";
            var_806 = "[ｶｴﾙ]";
            var_808 = "小さなｶｴﾙだ";
            var_828 = "食べると体力が５０回復するぞ";
            var_1946 = "体力が回復した";
        }
        if (var_232 == 651) {
            var_483 = 500;
            var_489 = "大きいｶｴﾙ";
            var_806 = "[ｶｴﾙ]";
            var_808 = "大きなｶｴﾙだ";
            var_828 = "食べると体力が１００回復するぞ";
            var_1946 = "体力が回復した";
        }
        if (var_232 == 652) {
            var_483 = 100;
            var_489 = "ｶｴﾙの死体";
            var_806 = "[ｶｴﾙ]";
            var_808 = "ｶｴﾙの死体だ";
            var_828 = "食べると体力が２０回復するぞ";
            var_1946 = "体力が回復した";
        }
        if (var_232 == 653) {
            var_483 = 1000;
            var_489 = "超巨大なｶｴﾙ";
            var_806 = "[ｶｴﾙ]";
            var_808 = "超巨大なｶｴﾙだ";
            var_828 = "食べると体力が完全回復するぞ";
            var_1946 = "体力が回復した";
        }
        if (var_232 == 654) {
            var_483 = 100;
            var_489 = "ﾔﾄﾞｸｶﾞｴﾙ";
            var_806 = "[ｶｴﾙ]";
            var_808 = "ﾔﾄﾞｸｶﾞｴﾙだ";
            var_828 = "投げると８０のダメージを与えるぞ";
            var_1946 = "８０のダメージを受けた！";
        }
        if (var_232 == 655) {
            var_483 = 100;
            var_489 = "ｻﾞﾘｶﾞﾆ";
            var_806 = "[ｻﾞﾘｶﾞﾆ]";
            var_808 = "ｻﾞﾘｶﾞﾆだ";
            var_828 = "食べると体力が１０回復するぞ";
            var_1946 = "体力が回復した";
        }
        if (var_232 == 712) {
            var_483 = 10000;
            var_489 = "やばいクスリ";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "高値で取引されているブツだ";
            var_828 = "体力が全回復するが混乱するぞ";
            var_1946 = "　あっあっあっ　　　　　うﾋﾋ";
            var_1947 = "　　ウケケ　　　　うおっうぉっ";
        }
        if (var_232 == 713) {
            var_483 = 100;
            var_489 = "ﾎﾟﾙﾎﾟのﾗｲﾀｰ";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "入団テストに使うﾎﾟﾙﾎﾟのﾗｲﾀｰだ";
            var_828 = "信頼を試すぞ";
            var_1946 = "『再点火』したな！";
        }
        if (var_232 == 714) {
            var_483 = 2000;
            var_489 = "紫外線照射装置";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "部屋全体に紫外線を照射するぞ";
            var_828 = "吸血鬼やゾンビを消滅させるぞ";
            var_1946 = "エネルギーが尽きた。";
        }
        if (var_232 == 715) {
            var_483 = 500;
            var_489 = "点滴";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "ブドウ糖とビタミン栄養剤の点滴だ";
            var_828 = "満腹度が30回復するぞ";
            var_1946 = "「栄養補給させてもらったぜ！」";
        }
        if (var_232 == 716) {
            var_483 = 2000;
            var_489 = "恐竜の化石";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "ｽﾋﾟﾉｻｳﾙｽの化石だ。使うと危険だぞ。";
            var_828 = "持っていると一巡後の世界に変化があるぞ";
            var_1946 = "声の主は去っていったようだ…";
        }
        if (var_232 == 717) {
            var_483 = 100;
            var_489 = "ｺﾋﾟｰ人形の破片";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "コピー人形の破片だ";
            var_1946 = "しかし何も起こらなかった…";
        }
        if (var_232 == 718) {
            var_483 = 1000;
            var_489 = "聖なる弓矢";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "装備中のDISCの合成容量が１増えるぞ";
            var_828 = "";
            var_1946 = "";
        }
        if (var_232 == 719) {
            var_483 = 1000;
            var_489 = "吉良の弓矢";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "装備中のDISCに新たな能力が増えるぞ";
            var_828 = "";
            var_1946 = "";
        }
        if (var_232 == 720) {
            var_483 = 1000;
            var_489 = "ときのがくぼう";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "５ターン 時を止められるぞ";
            var_828 = "";
            var_1946 = "時は止まった…";
        }
        if (var_232 == 721) {
            var_483 = 100;
            var_489 = "彼女の手首";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "手首だ";
            var_1946 = "しかし何も起こらなかった…";
        }
        if (var_232 == 722) {
            var_483 = 100;
            var_489 = "ｼｰｻﾞｰのﾊﾞﾝﾀﾞﾅ";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "ｼｰｻﾞｰの残したﾊﾞﾝﾀﾞﾅだ";
            var_828 = "";
            var_1946 = "「おめえどこだ！」";
        }
        if (var_232 == 723) {
            var_483 = 1500;
            var_489 = "魔法のランプ";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "願いを叶えてくれるランプだ";
            var_828 = "";
            var_1946 = "カリカリカリカリ・・・";
        }
        if (var_232 == 724) {
            var_483 = 1500;
            var_489 = "石仮面";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "吸血鬼体質になる仮面だ";
            var_828 = "体力が急速に回復するようになるぞ";
            var_1946 = "「俺は人間をやめるぞォ――！」";
        }
        if (var_232 == 725) {
            var_483 = 100;
            var_489 = "ｵﾚｯちのｺｰﾄ";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "ﾔｸ中のｺﾞﾛﾂｷが大事にしているｺｰﾄだ";
            var_828 = "持っていると危険だぞ";
            var_1946 = "特に何も起こらなかった…";
        }
        if (var_232 == 726) {
            var_483 = 1000;
            var_489 = "鉄球";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "このフロアで射撃ダメージを少なくするぞ";
            var_828 = "投げると８０のダメージを与えるぞ";
            var_1946 = "「鉄球の回転」";
            var_1947 = "皮膚が硬くなった！";
        }
        if (var_232 == 727) {
            var_483 = 1000;
            var_489 = "ｿﾞﾝﾋﾞ馬";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "体力が完全回復するぞ";
            var_828 = "";
            var_1946 = "体力が完全に回復した！";
            var_1947 = "";
        }
        if (var_232 == 728) {
            var_483 = 2000;
            var_489 = "赤石つき石仮面";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "究極生物体質になる仮面だ。ﾚｸｲｴﾑの大迷宮を";
            var_828 = "特定条件でｸﾘｱすると出現しはじめるぞ。";
            var_1946 = "「フン！」";
            var_1947 = "";
        }
        if (var_232 == 729) {
            var_483 = 2000;
            var_489 = "吉良の財布";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "こいつはプレゼントか～～？";
            var_828 = "もらっておいてやるぜ……オジサン";
            var_1946 = "";
            var_1947 = "";
        }
        if (var_232 == 730) {
            var_483 = 3000;
            var_489 = "大家のカバン";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "大金が入ってそうなカバンだ。";
            var_828 = "";
            var_1946 = "";
            var_1947 = "";
        }
        if (var_232 == 731) {
            var_483 = 500;
            var_489 = "盗まれた財布";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "玉美がカツアゲした財布だ。";
            var_828 = "お金が入っているように見えるぞ。";
            var_1946 = "";
            var_1947 = "";
        }
        if (var_232 == 750) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　7巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 751) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　8巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 752) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　9巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 753) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　10巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 754) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　11巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 755) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　12巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 756) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　13巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 757) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　14巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 758) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　15巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 799) {
            var_483 = 20;
            var_489 = "装備＋９９";
            var_806 = "[消費ｱｲﾃﾑ]";
            var_808 = "テスト用のアイテムだ";
            var_828 = "装備品の修正値が９９になるぞ";
            var_1946 = "装備品が強くなった！";
        }
        if (var_232 == 800) {
            var_483 = 2400;
            var_489 = "ｴﾆｸﾞﾏの紙";
            var_806 = "[保管ｱｲﾃﾑ]";
            var_808 = "何でも紙にして保管できるぞ";
            var_828 = "ｱｲﾃﾑを自由に出し入れできるぞ";
            var_1984 = 4;
        }
        if (var_232 == 801) {
            var_483 = 400;
            var_489 = "形兆のDISCｹｰｽ";
            var_806 = "[保管ｱｲﾃﾑ]";
            var_808 = "几帳面な形兆のDISCｹｰｽだ";
            var_828 = "DISCが入っているぞ";
            var_1984 = 4;
        }
        if (var_232 == 802) {
            var_483 = 400;
            var_489 = "ﾄﾗｸﾀｰのﾀｲﾔ";
            var_806 = "[保管ｱｲﾃﾑ]";
            var_808 = "F･FがDISCを保管しておいたﾀｲﾔだ";
            var_828 = "DISCがたくさん入っているぞ";
            var_1984 = 6;
        }
        if (var_232 == 803) {
            var_483 = 400;
            var_489 = "ｻﾝｼﾞｪﾙﾏﾝの紙袋";
            var_806 = "[保管ｱｲﾃﾑ]";
            var_808 = "ｻﾝｼﾞｪﾙﾏﾝの紙袋だ";
            var_828 = "食料が入っているぞ";
            var_1984 = 4;
        }
        if (var_232 == 804) {
            var_483 = 400;
            var_489 = "露伴のカバン";
            var_806 = "[保管ｱｲﾃﾑ]";
            var_808 = "露伴が資料を持ち運ぶ時のｶﾊﾞﾝだ";
            var_828 = "コミックスが入っているぞ";
            var_1984 = 4;
        }
        if (var_232 == 805) {
            var_483 = 1600;
            var_489 = "ｸﾞｯﾁｮの死体";
            var_806 = "[ヤバイもの]";
            var_808 = "グッチョの死体だ";
            var_828 = "DISCを入れると歌いだすぞ";
            var_1984 = 6;
        }
        if (var_232 == 806) {
            var_483 = 4600;
            var_489 = "ｶﾙﾈの死体";
            var_806 = "[ヤバイもの]";
            var_808 = "カルネの死体だ";
            var_828 = "入れたものは喰われて消えるぞ";
            var_1984 = 5;
        }
        if (var_232 == 807) {
            var_483 = 4600;
            var_489 = "DIOの骨";
            var_806 = "[ヤバイもの]";
            var_808 = "新しいものを生み出すDIOの骨だ";
            var_828 = "装備DISCが合成されるぞ";
            var_1984 = 6;
        }
        if (var_232 == 808) {
            var_483 = 2400;
            var_489 = "聖人の眼球";
            var_806 = "[ヤバイもの]";
            var_808 = "聖人の遺体の一部分だ";
            var_828 = "持ち物が識別されるぞ";
            var_1984 = 11;
        }
        if (var_232 == 809) {
            var_483 = 2400;
            var_489 = "聖人の左腕";
            var_806 = "[ヤバイもの]";
            var_808 = "聖人の遺体の一部分だ";
            var_828 = "ｱｲﾃﾑの呪縛や爆弾化を解除するぞ";
            var_1984 = 11;
        }
        if (var_232 == 815) {
            var_483 = 4600;
            var_489 = "ｴﾙﾒｪｽのｱﾚ";
            var_806 = "[ヤバイもの]";
            var_808 = "ｷｯｽのｼｰﾙで入れたものが分裂するぞ";
            var_828 = "装備品は数値も分裂するぞ";
            var_1984 = 6;
        }
        if (var_232 == 816) {
            var_483 = 2400;
            var_489 = "ﾐｷﾀｶのｶﾊﾞﾝ";
            var_806 = "[ヤバイもの]";
            var_808 = "何でも出てくるﾐｷﾀｶのｶﾊﾞﾝだ";
            var_828 = "ｱｲﾃﾑを入れると別のものにしてくれるぞ";
            var_1984 = 4;
        }
        if (var_232 == 817) {
            var_483 = 4600;
            var_489 = "乳母車";
            var_806 = "[ヤバイもの]";
            var_808 = "透明な赤ちゃんが入っているようだ";
            var_828 = "入れたものが見えなくなってしまうぞ";
            var_1984 = 4;
        }
        if (var_232 == 850) {
            var_483 = 2700;
            var_489 = "波紋のツボ";
            var_806 = "[ヤバイもの]";
            var_808 = "ツボを突いて波紋が使えるようになるぞ。";
            var_828 = "体力も回復し、状態異常が治るぞ。";
            var_1984 = 0;
        }
        if (var_232 == 851) {
            var_483 = 2500;
            var_489 = "ﾎﾙﾏｼﾞｵのﾋﾞﾝ";
            var_806 = "[ヤバイもの]";
            var_808 = "敵に投げると小さくして入れられるぞ";
            var_828 = "押すと目の前に混乱して出てくるぞ";
            var_1984 = 5;
        }
        if (var_232 == 852) {
            var_483 = 2600;
            var_489 = "ランドセル";
            var_806 = "[ヤバイもの]";
            var_808 = "猫草が入っているランドセルだ";
            var_828 = "押すと前方に強力な空気弾を発射するぞ";
            var_1984 = 4;
        }
        if (var_232 == 853) {
            var_483 = 2800;
            var_489 = "ｻｰﾌｨｽ人形";
            var_806 = "[ヤバイもの]";
            var_808 = "10ﾀｰﾝの間、自分のｺﾋﾟｰが出現するぞ";
            var_828 = "敵はコピー人形を優先して攻撃するぞ";
            var_1984 = 4;
        }
        if (var_232 == 854) {
            var_483 = 2900;
            var_489 = "聖人の脊椎";
            var_806 = "[ヤバイもの]";
            var_808 = "他の場所に一瞬にして移動するぞ";
            var_828 = "";
            var_1984 = 11;
        }
        if (var_232 == 900) {
            var_483 = 390;
            var_489 = "GP BOY";
            var_806 = "グランプリボーイのコミックスだ";
            var_808 = "";
            var_828 = "特に何も起こらないぞ";
            var_1946 = "しかし何も起こらなかった";
        }
        if (var_232 == 901) {
            var_483 = 360;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　1巻";
            var_806 = "1部のコミックスだ";
            var_808 = "生命賛歌の素晴らしさを知ろう";
            var_828 = "精神力の最大値が上がるぞ";
            var_1946 = "精神力の最大値が１上がった！";
        }
        if (var_232 == 902) {
            var_483 = 370;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　2巻";
            var_806 = "1部のコミックスだ";
            var_808 = "生命賛歌の素晴らしさを知ろう";
            var_828 = "精神力の最大値が上がるぞ";
            var_1946 = "精神力の最大値が１上がった！";
        }
        if (var_232 == 903) {
            var_483 = 360;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　3巻";
            var_806 = "1部のコミックスだ";
            var_808 = "生命賛歌の素晴らしさを知ろう";
            var_828 = "精神力の最大値が上がるぞ";
            var_1946 = "精神力の最大値が１上がった！";
        }
        if (var_232 == 904) {
            var_483 = 360;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　4巻";
            var_806 = "1部のコミックスだ";
            var_808 = "生命賛歌の素晴らしさを知ろう";
            var_828 = "精神力の最大値が上がるぞ";
            var_1946 = "精神力の最大値が１上がった！";
        }
        if (var_232 == 905) {
            var_483 = 360;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　5巻";
            var_806 = "1部のコミックスだ";
            var_808 = "生命賛歌の素晴らしさを知ろう";
            var_828 = "精神力の最大値が上がるぞ";
            var_1946 = "精神力の最大値が１上がった！";
        }
        if (var_232 == 906) {
            var_483 = 360;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　6巻";
            var_806 = "2部のコミックスだ";
            var_808 = "肉体の限界を極める方法を知ろう";
            var_828 = "最大ＨＰが５上がるぞ";
            var_1946 = "最大ＨＰが５上がった！";
        }
        if (var_232 == 907) {
            var_483 = 360;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　7巻";
            var_806 = "2部のコミックスだ";
            var_808 = "肉体の限界を極める方法を知ろう";
            var_828 = "最大ＨＰが５上がるぞ";
            var_1946 = "最大ＨＰが５上がった！";
        }
        if (var_232 == 908) {
            var_483 = 360;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　8巻";
            var_806 = "2部のコミックスだ";
            var_808 = "肉体の限界を極める方法を知ろう";
            var_828 = "最大ＨＰが５上がるぞ";
            var_1946 = "最大ＨＰが５上がった！";
        }
        if (var_232 == 909) {
            var_483 = 370;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　9巻";
            var_806 = "2部のコミックスだ";
            var_808 = "肉体の限界を極める方法を知ろう";
            var_828 = "最大ＨＰが５上がるぞ";
            var_1946 = "最大ＨＰが５上がった！";
        }
        if (var_232 == 910) {
            var_483 = 370;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　10巻";
            var_806 = "2部のコミックスだ";
            var_808 = "肉体の限界を極める方法を知ろう";
            var_828 = "最大ＨＰが５上がるぞ";
            var_1946 = "最大ＨＰが５上がった！";
        }
        if (var_232 == 911) {
            var_483 = 370;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　11巻";
            var_806 = "2部のコミックスだ";
            var_808 = "肉体の限界を極める方法を知ろう";
            var_828 = "最大ＨＰが５上がるぞ";
            var_1946 = "最大ＨＰが５上がった！";
        }
        if (var_232 == 912) {
            var_483 = 370;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　12巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 913) {
            var_483 = 370;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　13巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 914) {
            var_483 = 370;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　14巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 915) {
            var_483 = 370;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　15巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 916) {
            var_483 = 370;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　16巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 917) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　17巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 918) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　18巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 919) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　19巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 920) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　20巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 921) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　21巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 922) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　22巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 923) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　23巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 924) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　24巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 925) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　25巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 926) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　26巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 927) {
            var_483 = 400;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　27巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 928) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　28巻";
            var_806 = "3部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "3部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 929) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　29巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 930) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　30巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 931) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　31巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 932) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　32巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 933) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　33巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 934) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　34巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 935) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　35巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 936) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　36巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 937) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　37巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 938) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　38巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 939) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　39巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 940) {
            var_483 = 400;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　40巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 941) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　41巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 942) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　42巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 943) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　43巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 944) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　44巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 945) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　45巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 946) {
            var_483 = 400;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　46巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 947) {
            var_483 = 400;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　47巻";
            var_806 = "4部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "4部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 948) {
            var_483 = 400;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　48巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 949) {
            var_483 = 400;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　49巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 950) {
            var_483 = 400;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　50巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 951) {
            var_483 = 388;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　51巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 952) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　52巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 953) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　53巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 954) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　54巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 955) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　55巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 956) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　56巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 957) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　57巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 958) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　58巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 959) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　59巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 960) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　60巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 961) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　61巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 962) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　62巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 963) {
            var_483 = 390;
            var_489 = "ｼﾞｮｼﾞｮの奇妙な冒険　63巻";
            var_806 = "5部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "5部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 964) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　1巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 965) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　2巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 966) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　3巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 967) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　4巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 968) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　5巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 969) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　6巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 970) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　7巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 971) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　8巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 972) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　9巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 973) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　10巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 974) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　11巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 975) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　12巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 976) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　13巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 977) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　14巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 978) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　15巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 979) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　16巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 980) {
            var_483 = 390;
            var_489 = "ストーンオーシャン　17巻";
            var_806 = "6部のコミックスだ";
            var_808 = "ｽﾀﾝﾄﾞの使い方を勉強しよう";
            var_828 = "6部の装備ｽﾀﾝﾄﾞが強くなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 981) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　1巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 982) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　2巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 983) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　3巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 984) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　4巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 985) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　5巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 986) {
            var_483 = 390;
            var_489 = "STEEL BALL RUN　6巻";
            var_806 = "7部のコミックスだ";
            var_808 = "どの部の装備ｽﾀﾝﾄﾞでも強くできるぞ";
            var_828 = "ｽﾀﾝﾄﾞが劣化しなくなるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 987) {
            var_483 = 370;
            var_489 = "バオー来訪者　1巻";
            var_806 = "バオー来訪者のコミックスだ";
            var_808 = "";
            var_828 = "最大ＨＰが１０上がるぞ";
            var_1946 = "最大ＨＰが１０上がった！";
        }
        if (var_232 == 988) {
            var_483 = 370;
            var_489 = "バオー来訪者　2巻";
            var_806 = "バオー来訪者のコミックスだ";
            var_808 = "";
            var_828 = "最大ＨＰが１０上がるぞ";
            var_1946 = "最大ＨＰが１０上がった！";
        }
        if (var_232 == 989) {
            var_483 = 370;
            var_489 = "魔少年ビーティー";
            var_806 = "魔少年ビーティーのコミックスだ";
            var_808 = "";
            var_828 = "精神力の最大値が５上がるぞ";
            var_1946 = "精神力の最大値が５上がった！";
        }
        if (var_232 == 990) {
            var_483 = 370;
            var_489 = "ゴージャス☆アイリン";
            var_806 = "ゴージャス☆アイリンのコミックスだ";
            var_808 = "";
            var_828 = "攻撃力・命中率・回避率がアップするぞ";
            var_1946 = "わたし、残酷ですわよ";
        }
        if (var_232 == 991) {
            var_483 = 1200;
            var_489 = "死刑執行中脱獄進行中";
            var_806 = "短編集だ";
            var_808 = "";
            var_828 = "レベルが一気に２上がるぞ";
            var_1946 = "ディアボロはレベルが上がった！";
        }
        if (var_232 == 992) {
            var_483 = 1800;
            var_489 = "変人偏屈列伝";
            var_806 = "短編集だ";
            var_808 = "";
            var_828 = "レベルが一気に２上がるぞ";
            var_1946 = "ディアボロはレベルが上がった！";
        }
        if (var_232 == 993) {
            var_483 = 2000;
            var_489 = "JOJO 6251";
            var_806 = "画集だ";
            var_808 = "ｷｬﾗｸﾀｰの色使いを勉強しよう";
            var_828 = "ｽﾀﾝﾄﾞの色を変更できるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 994) {
            var_483 = 6800;
            var_489 = "JOJO A GOGO";
            var_806 = "凶器になりえる画集だ";
            var_808 = "ｷｬﾗｸﾀｰの色使いを勉強しよう";
            var_828 = "ｽﾀﾝﾄﾞの色を変更できるぞ";
            var_1946 = "どのｽﾀﾝﾄﾞを研究しますか？";
        }
        if (var_232 == 995) {
            var_483 = 390;
            var_489 = "ピンクダークの少年";
            var_806 = "岸部露伴の単行本だ";
            var_808 = "彼の原稿を見たものは本になってしまうぞ。";
            var_828 = "目の前の相手に使うと情報がわかるぞ。";
            var_1946 = "";
        }
        if (var_232 == 996) {
            var_483 = 20000;
            var_489 = "ﾋﾛﾋｺのｻｲﾝ色紙";
            var_806 = "超レアアイテムだぞ";
            var_808 = "";
            var_828 = "レベルが一気に１０上がるぞ";
            var_1946 = "ディアボロはレベルが上がった！";
        }
        if (var_869 == 1 || var_262 == 1) {
            return;
        }
        if (var_375 == 1) {
            return;
        }
        if (var_62 == 1) {
            return;
        }
        if (var_1677 == 1) {
            return;
        }
        if (var_800 == 1) {
            return;
        }
        if (var_980 == 1) {
            return;
        }
        if (var_2176 == 1) {
            return;
        }
        if (var_62 == 3 || var_62 == 4 || var_62 == 5) {
            if (var_232 >= 100 && var_232 < 400 && var_862[var_232][0] == 0) {
                yield func503();
            }
        }
        if (var_862[var_232][0] == 0 && var_232 >= 100 && var_232 < 400) {
            var_2039 = "何かわからんが発動";
        }
        if (var_232 >= 560 && var_232 < 600 && var_862[var_232][0] == 0) {
            yield func503();
        }
        if (var_62 >= 2) {
            if (var_232 >= 805 && var_232 < 900 && var_862[var_232][0] == 0) {
                yield func503();
            }
            if (var_232 == 800 && var_862[var_232][0] == 0) {
                yield func503();
            }
        }
        return;
    });
}
